 

/*
    REFEXT PROJECT 
    Prof. Charlotte Schubert, Alte Geschichte Leipzig 2019

    # GPLv3 copyrigth
    # This program is free software: you can redistribute it and/or modify
    # it under the terms of the GNU General Public License as published by
    # the Free Software Foundation, either version 3 of the License, or
    # (at your option) any later version.
    # This program is distributed in the hope that it will be useful,
    # but WITHOUT ANY WARRANTY; without even the implied warranty of
    # MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    # GNU General Public License for more details.
    # You should have received a copy of the GNU General Public License
    # along with this program.  If not, see <http://www.gnu.org/licenses/>.

*/

//experimenal links:
//http://localhost/pages/testdata2.tml
//http://tlrr.blackmesatech.com/2013/tlrr.1.xhtml
//https://digi.ub.uni-heidelberg.de/diglit/mdav1958/0054/text_ocr
//https://digi.ub.uni-heidelberg.de/diglit/atpsrl11_12/0032/text_ocr

//https://digi.ub.uni-heidelberg.de/diglit/atpsrl11_12/0042/text_ocr
//https://digi.ub.uni-heidelberg.de/diglit/amalthea1820/0214/text_ocr
//https://digi.ub.uni-heidelberg.de/diglit/aephem1862/0023/text_ocr - Παυσανία Pausaniae
//https://digi.ub.uni-heidelberg.de/diglit/aephem1862/0033/text_ocr insc. greac. (griechisch)

//https://www.hadw-bw.de/forschung/forschungsstelle/malalas-kommentar

"use strict";


/*------------------------------------------------------------------------------
                        GLOB
------------------------------------------------------------------------------*/
let zifferstring = { "0": "", "1": "", "2": "", "3": "", "4": "", "5": "", "6": "", "7": "", "8": "", "9": ""};

//Testdata GOLDstandart
let globalgoldindex = 1;
let data = [
    ["str1", "str2", "ref1", "ref2"],
    ["πρῶτον μὲν οὐσίαν κεκτημένον μηδεμίαν μηδένα ἰδίαν, ἂν μὴ πᾶσα ἀνάγκη: ἔπειτα οἴκησιν καὶ ταμιεῖον μηδενὶ εἶναι μηδὲν τοιοῦτον, εἰς ὃ οὐ πᾶς ὁ βουλόμενος εἴσεισι: τὰ δ᾽ ἐπιτήδεια, ὅσων δέονται ἄνδρες ἀθληταὶ πολέμου σώφρονές τε καὶ ἀνδρεῖοι, ταξαμένους παρὰ τῶν ἄλλων πολιτῶν δέχεσθαι μισθὸν τῆς φυλακῆς τοσοῦτον ὅσον μήτε περιεῖναι αὐτοῖς εἰς τὸν ἐνιαυτὸν μήτε ἐνδεῖν: φοιτῶντας δὲ εἰς συσσίτια ὥσπερ ἐστρατοπεδευμένους κοινῇ ζῆν", "περὶ δὲ τῆς διανομῆς καὶ τῶν γεωργούντων, τίνας καὶ ποίους εἶναι χρή, λεκτέον πρῶτον, ἐπειδὴ οὔτε κοινήν φαμεν εἶναι δεῖν τὴν κτῆσιν ὥσπερ τινὲς εἰρήκασιν, ἀλλὰ τῇ χρήσει φιλικῶς γινομένῃ κοινήν, οὔτ’ ἀπορεῖν οὐθένα τῶν πολιτῶν τροφῆς. περὶ συσσιτίων τε συνδοκεῖ πᾶσι χρήσιμον εἶναι ταῖς εὖ κατεσκευασμέναις πόλεσιν ὑπάρχειν·", "Plat. resp. 3, 416d-e", "Arist. Pol. 2, 1329b39-1330a5"],
    ["Οὐδαμῶς, ἔφη· ἀλλὰ κινδυνεύει σοι δωριστὶ λείπεσθαι καὶ φρυγιστί.", "ὁ δ’ ἐν τῇ Πολιτείᾳ Σωκράτης οὐ καλῶς τὴν φρυγιστὶ μόνην καταλείπει μετὰ τῆς δωριστί, καὶ ταῦτα ἀποδοκιμάσας τῶν ὀργάνων τὸν αὐλόν.", "Plat. resp. 3, 399a", "Arist. Pol. 7, 1342a32-b1"],
    ["ἢ οἴει τι διάφορον δρᾶν τοὺς τοῦτο ποιοῦντας τῶν κυνῶν, αἳ τοῖς λίθοις οἷς ἂν βληθῶσι χαλεπαίνουσι, τοῦ βάλλοντος οὐχ ἁπτόμεναι;", "καὶ τὸ ἐν τῇ Πολιτείᾳ τῇ Πλάτωνος, ὅτι οἱ τοὺς τεθνεῶτας σκυλεύοντες ἐοίκασι τοῖς κυνιδίοις ἃ τοὺς λίθους δάκνει, τοῦ βάλλοντος οὐχ ἁπτόμενα.", "Plat. resp. 5, 469d-e", "Arist. Rhet. 3, 1406b32-1407a1"],
    ["ναύκληρον μεγέθει μὲν καὶ ῥώμῃ ὑπὲρ τοὺς ἐν τῇ νηὶ πάντας, ὑπόκωφον δὲ καὶ ὁρῶντα ὡσαύτως βραχύ τι καὶ γιγνώσκοντα περὶ ναυτικῶν ἕτερα τοιαῦτα,", "καὶ τὸ ἐν τῇ Πολιτείᾳ τῇ Πλάτωνος, ὅτι οἱ τοὺς τεθνεῶτας σκυλεύοντες ἐοίκασι τοῖς κυνιδίοις ἃ τοὺς λίθους δάκνει, τοῦ βάλλοντος οὐχ ἁπτόμενα, καὶ ἡ εἰς τὸν δῆμον, ὅτι ὅμοιος ναυκλήρῳ ἰσχυρῷ μὲν ὑποκώφῳ δέ καὶ ἡ εἰς τὰ μέτρα τῶν ποιητῶν, ὅτι ἔοικε τοῖς ἄνευ κάλλους ὡραίοις·", "Plat. resp. 6, 488a-b", "Arist. Rhet. 3, 1406b35-36"],
    ["Οὐκοῦν, ἦν δ’ ἐγώ, ἔοικεν τοῖς τῶν ὡραίων προσώποις, καλῶν δὲ μή, οἷα γίγνεται ἰδεῖν ὅταν αὐτὰ τὸ ἄνθος προλίπῃ;", "καὶ τὸ ἐν τῇ Πολιτείᾳ τῇ Πλάτωνος, ὅτι οἱ τοὺς τεθνεῶτας σκυλεύοντες ἐοίκασι τοῖς κυνιδίοις ἃ τοὺς λίθους δάκνει, τοῦ βάλλοντος οὐχ ἁπτόμενα, καὶ ἡ εἰς τὸν δῆμον, ὅτι ὅμοιος ναυκλήρῳ ἰσχυρῷ μὲν ὑποκώφῳ δέ, καὶ ἡ εἰς τὰ μέτρα τῶν ποιητῶν, ὅτι ἔοικε τοῖς ἄνευ κάλλους ὡραίοις• οἱ μὲν γὰρ ἀπανθήσαντες, τὰ δὲ διαλυθέντα οὐχ ὅμοια φαίνεται.", "Plat. resp. 601b", "Arist. Rhet. 3, 1406b32-1407a1"],
    ["Ἓν μὲν δὴ τοῦτο τοσοῦτον ὀλιγαρχία ἂν ἔχοι ἁμάρτημα. Φαίνεται. Τί δέ; τόδε ἆρά τι τούτου ἔλαττον; Τὸ ποῖον; Τὸ μὴ μίαν ἀλλὰ δύο ἀνάγκῃ εἶναι τὴν τοιαύτην πόλιν, τὴν μὲν πενήτων, τὴν δὲ πλουσίων, οἰκοῦντας ἐν τῷ αὐτῷ ἀεὶ ἐπιβουλεύοντας ἀλλήλοις.", "ἄτοπον δὲ καὶ τὸ φάναι δύο πόλεις εἶναι τὴν ὀλιγαρχικήν, πλουσίων καὶ πενήτων.", "Plat. resp. 8, 551d", "Aristot. Polit. 1316b6-7"],
    ["ὑμῖν γάρ, ὦ Κλεινία καὶ Μέγιλλε, τὰ μὲν περὶ τοὺς ἄνδρας συσσίτια καλῶς ἅμα καί, ὅπερ εἶπον, θαυμαστῶς καθέστηκεν ἐκ θείας τινὸς ἀνάγκης τὸ δὲ περὶ τὰς γυναῖκας οὐδαμῶς ὀρθῶς ἀνομοθέτητον μεθεῖται καὶ οὐκ εἰς τὸ φῶς ἦκται τὸ τῆς συσσιτίας αὐτῶν ἐπιτήδευμα, ἀλλ’ ὃ καὶ ἄλλως γένος ἡμῶν τῶν ἀνθρώπων λαθραιότερον μᾶλλον καὶ ἐπικλοπώτερον ἔφυ, τὸ θῆλυ, διὰ τὸ ἀσθενές, οὐκ ὀρθῶς τοῦτο εἴξαντος τοῦ νομοθέτου δύστακτον ὂν ἀφείθη.", "καὶ γὰρ παιδείαν τὴν αὐτήν, καὶ τὸ τῶν ἔργων τῶν ἀναγκαίων ἀπεχομένους ζῆν, καὶ περὶ συσσιτίων ὡσαύτως· πλὴν ἐν ταύτῃ φησὶ δεῖν εἶναι συσσίτια καὶ γυναικῶν", "Plat. Leg. 6, 780d-781", "Aristot. Polit. 1265a6-9"],
    ["Πεντάκις μὲν χίλιοι ἔστωσαν καὶ τετταράκοντα, ἀριθμοῦ τινος ἕνεκα προσήκοντος, γεωμόροι τε καὶ ἀμυνοῦντες τῇ νομῇ·", "πλὴν ἐν ταύτῃ φησὶ δεῖν εἶναι συσσίτια καὶ γυναικῶν,καὶ τὴν μὲν χιλίων τῶν ὅπλα κεκτημένων, ταύτην δὲ πεντακισχιλίων.", "Plat. Leg. 5, 737e", "Aristot. Polit. 1265a6-10"],
    ["καθάπερ οὖν δή τινα συνυφὴν ἢ καὶ πλέγμ’ ἄλλ’ ὁτιοῦν, οὐκ ἐκ τῶν αὐτῶν οἷόν τ’ ἐστὶν τήν τε ἐφυφὴν καὶ τὸν στήμονα ἀπεργάζεσθαι, διαφέρειν δ’ ἀναγκαῖον τὸ τῶν στημόνων πρὸς ἀρετὴν γένος—ἰσχυρόν τε γὰρ καί τινα βεβαιότητα ἐν τοῖς τρόποις εἰληφός, τὸ δὲ μαλακώτερον καὶ ἐπιεικείᾳ τινὶ δικαίᾳ χρώμενον—ὅθεν δὴ τοὺς τὰς ἀρχὰς ἐν ταῖς πόλεσιν ἄρξοντας δεῖ διακρίνεσθαί τινα τρόπον ταύτῃ καὶ τοὺς σμικρᾷ παιδείᾳ βασανισθέντας ἑκάστοτε κατὰ λόγον.", "φησὶ γὰρ δεῖν, ὥσπερ ἐξ ἑτέρου τὸ στημόνιον ἐρίου γίνεται τῆς κρόκης,   οὕτω καὶ τοὺς ἄρχοντας ἔχειν δεῖν πρὸς τοὺς ἀρχομένους.", "Plat. Leg. 5, 734e-735a", "Aristot. Polit. 1265b19-21"],
    ["εἰ δ’ ἔστιν τοῦτο οὕτως ἔχον, μὴ ἄλλο τι εἶναι τὸ αὐτὸ ἑαυτὸ κινοῦν ἢ ψυχήν, ἐξ ἀνάγκης ἀγένητόν τε καὶ ἀθάνατον ψυχὴ ἂν εἴη.", "τοιοῦτος δὲ καὶ ὁ τῆς ψυχῆς ὅρος, εἴπερ “ἀριθμὸς αὐτὸς αὑτὸν κινῶν” ἐστιν· καὶ γὰρ τὸ αὐτὸ αὑτὸ κινοῦν ψυχή, καθάπερ Πλάτων ὥρισται.", "Plat. Phaedr. 245e-246a", "Aristot. Top. 140b2-4"],
    ["εἰ δ’ ἔστιν τοῦτο οὕτως ἔχον, μὴ ἄλλο τι εἶναι τὸ αὐτὸ ἑαυτὸ κινοῦν ἢ ψυχήν, ἐξ ἀνάγκης ἀγένητόν τε καὶ ἀθάνατον ψυχὴ ἂν εἴη.", "ἀλλὰ μὴν οὐδὲ Πλάτωνί γε οἷόν τε λέγειν ἣν οἴεται ἐνίοτε ἀρχὴν εἶναι, τὸ αὐτὸ ἑαυτὸ κινοῦν· ὕστερον γὰρ καὶ ἅμα τῷ οὐρανῷ ἡ ψυχή, ὡς φησίν.", "Plat. Phaedr. 245e-246a", "Aristot. Metaph. 1071b37-1072a3"],
    ["σὺ γὰρ τῷ ὄντι, ὦ Σώκρατες, εἰς τοιαῦτα ἄγεις φορτικὰ καὶ δημηγορικά, φάσκων τὴν ἀλήθειαν διώκειν, ἃ φύσει μὲν οὐκ ἔστιν καλά, νόμῳ δέ. ὡς τὰ πολλὰ δὲ ταῦτα ἐναντί’ ἀλλήλοις ἐστίν, ἥ τε φύσις καὶ ὁ νόμος·", "Πλεῖστος δὲ τόπος ἐστὶ τοῦ ποιεῖν παράδοξα λέγειν, ὥσπερ καὶ ὁ Καλλικλῆς ἐν τῷ Γοργίᾳ γέγραπται λέγων, καὶ οἱ ἀρχαῖοι δὲ πάντες ᾤοντο συμβαίνειν, παρὰ τὸ κατὰ φύσιν καὶ κατὰ τὸν νόμον· ἐναντία γὰρ εἶναι φύσιν καὶ νόμον, καὶ τὴν δικαιοσύνην κατὰ νόμον μὲν εἶναι καλόν, κατὰ φύσιν δ’ οὐ καλόν.", "Plat. Gorg. 482e-483a", "Aristot. Soph. elen. 173a7-14"],
    ["εἰσὶν ἑκάστοις τούτων λόγοι παρεσκευασμένοι, καὶ ἅμα οὐδὲ αὐτοσχεδιάζειν τά γε τοιαῦτα χαλεπόν. εἰ μὲν γὰρ δέοι Ἀθηναίους ἐν Πελοποννησίοις εὖ λέγειν ἢ Πελοποννησίους ἐν Ἀθηναίοις, ἀγαθοῦ ῥήτορος δέοι τοῦ πείσοντος ἂν καὶ εὐδοκιμήσοντος·", "ὃ γὰρ λέγει Σωκράτης ἐν τῷ ἐπιταφίῳ, ἀληθές, ὅτι οὐ χαλεπὸν λέγει Σωκράτης ἐν τῷ ἐπιταφίῳ, ἀληθές, ὅτι οὐ χαλεπὸν Ἀθηναίους ἐν Ἀθηναίοις ἐπαινεῖν, ἀλλ’ ἐν Λακεδαιμονίοις.", "Plat. Menex. 235d", "Aristot. Rhet. 1415b30-32"],
    ["ἀλλὰ καὶ ὅστις ἐμοῦ κάκιον ἐπαιδεύθη, μουσικὴν μὲν ὑπὸ Λάμπρου παιδευθείς, ῥητορικὴν δὲ ὑπ’ Ἀντιφῶντος τοῦ Ῥαμνουσίου, ὅμως κἂν οὗτος οἷός τ’ εἴη Ἀθηναίους γε ἐν Ἀθηναίοις ἐπαινῶν εὐδοκιμεῖν.", "ὃ γὰρ λέγει Σωκράτης ἐν τῷ ἐπιταφίῳ, ἀληθές, ὅτι οὐ χαλεπὸν λέγει Σωκράτης ἐν τῷ ἐπιταφίῳ, ἀληθές, ὅτι οὐ χαλεπὸν Ἀθηναίους ἐν Ἀθηναίοις ἐπαινεῖν, ἀλλ’ ἐν Λακεδαιμονίοις.", "Plat. Menex. 236a", "Aristot. Rhet. 1415b30-32"],
    ["ἀλλὰ καὶ ὅστις ἐμοῦ κάκιον ἐπαιδεύθη, μουσικὴν μὲν ὑπὸ Λάμπρου παιδευθείς, ῥητορικὴν δὲ ὑπ’ Ἀντιφῶντος τοῦ Ῥαμνουσίου, ὅμως κἂν οὗτος οἷός τ’ εἴη Ἀθηναίους γε ἐν Ἀθηναίοις ἐπαινῶν εὐδοκιμεῖν.", "ὥσπερ γὰρ ὁ Σωκράτης ἔλεγεν, οὐ χαλεπὸν Ἀθηναίους ἐν Ἀθηναίοις ἐπαινεῖν.", "Plat. Menex. 236a", "Aristot. Rhet. 1367b7-9"],
    ["τοὺς δὲ δαίμονας οὐχὶ ἤτοι θεούς γε ἡγούμεθα ἢ θεῶν παῖδας;", "πυθόμενον  μὲν γὰρ δεῖ τὴν μίαν πρότασιν μὴ προσερωτᾶν τὸ φανερὸν  ἀλλὰ τὸ συμπέρασμα εἰπεῖνοἷον Σωκράτης, Μελήτου οὐ φάσκοντος αὐτὸν θεοὺς νομίζειν, εἰρηκότος δὲ ὡς δαιμόνιόν τι λέγοι, ἤρετο εἰ οὐχ οἱ δαίμονες ἤτοι θεῶν παῖδες εἶεν ἢ θεῖόν τι, φήσαντος δὲ ”ἔστιν οὖν”, ἔφη, ”ὅστις θεῶν μὲν παῖδας οἴεται εἶναι, θεοὺς δὲ οὔ;", "Plat. Apol. 27c-d", "Aristot. Rhet. 1419a6-12"],
    ["εἰ δ’ αὖ οἱ δαίμονες θεῶν παῖδές εἰσιν νόθοι τινὲς ἢ ἐκ νυμφῶν ἢ ἔκ τινων ἄλλων ὧν δὴ καὶ λέγονται, τίς ἂν ἀνθρώπων θεῶν μὲν παῖδας ἡγοῖτο εἶναι, θεοὺς δὲ μή", "πυθόμενον  μὲν γὰρ δεῖ τὴν μίαν πρότασιν μὴ προσερωτᾶν τὸ φανερὸν  ἀλλὰ τὸ συμπέρασμα εἰπεῖνοἷον Σωκράτης, Μελήτου οὐ φάσκοντος αὐτὸν θεοὺς νομίζειν, εἰρηκότος δὲ ὡς δαιμόνιόν τι λέγοι, ἤρετο εἰ οὐχ οἱ δαίμονες ἤτοι θεῶν παῖδες εἶεν ἢ θεῖόν τι, φήσαντος δὲ “ἔστιν οὖν”, ἔφη, “ὅστις θεῶν μὲν παῖδας οἴεται εἶναι, θεοὺς δὲ οὔ", "Plat. Apol. 27d", "Aristot. Rhet. 1419a6-12"],
    ["ὅπως δὲ σύ τινα πείθοις ἂν καὶ σμικρὸν νοῦν ἔχοντα ἀνθρώπων, ὡς οὐ τοῦ αὐτοῦ ἔστιν καὶ δαιμόνια καὶ θεῖα ἡγεῖσθαι, καὶ αὖ τοῦ αὐτοῦ μήτε δαίμονας μήτε θεοὺς μήτε ἥρωας, οὐδεμία μηχανή ἐστιν.", "ἄλλος ἐξ ὁρισμοῦ, οἷον τί τὸ δαιμόνιόν ἐστιν· “ἆρα θεὸς ἢ θεοῦ ἔργον; καίτοι ὅστις οἴεται θεοῦ ἔργον εἶναι, τοῦτον ἀνάγκη οἴεσθαι καὶ θεοὺς εἶναι.", "Plat Apol. 27e-28a", "Aristot. Rhet. 1398a15-17"],
    ["καί μοι λέγε· ἆρα κινεῖσθαι καλεῖς ὅταν τι χώραν ἐκ χώρας μεταβάλλῃ ἢ καὶ ἐν τῷ αὐτῷ στρέφηται", "Ἔτι εἰ τὸ γένος εἰς τὸ εἶδος ἔθηκεν, οἷον τὴν ἅψιν ὅπερ συνοχὴν ἢ τὴν μεῖξιν ὅπερ κρᾶσιν, ἢ ὡς Πλάτων ὁρίζεται φορὰν τὴν κατὰ τόπον κίνησιν.", "Plat. Theaet. 181c", "Aristot. Top. 122b25-27"],
    ["ἆρα περὶ ἡδονῆς οὐκ ἀκηκόαμεν ὡς ἀεὶ γένεσίς ἐστιν, οὐσία δὲ οὐκ ἔστι τὸ παράπαν ἡδονῆς", "Πρῶτον μὲν γάρ φασιν εἶναι τὴν ἡδονὴν γένεσιν, τὴν δὲ γένεσιν ἀτελές τι, τὸ δὲ ἀγαθὸν οὐδέποτε τὴν τοῦ ἀτελοῦς χώραν ἔχειν.", "Plat. Phileb. 53c", "Aristot. Mag. Mor. 1204a33-36"],
    ["ἀποροῦντι δὲ αὐτῷ ἔρχεται Προμηθεὺς ἐπισκεψό-μενος τὴν νομήν, καὶ ὁρᾷ τὰ μὲν ἄλλα ζῷα ἐμμελῶς πάντων ἔχοντα, τὸν δὲ ἄνθρωπον γυμνόν τε καὶ ἀνυπόδητον καὶ ἄστρωτον καὶ ἄοπλον·", "Ἀλλ’ οἱ λέγοντες ὡς συνέστηκεν οὐ καλῶς ὁ ἄνθρωπος ἀλλὰ χείριστα τῶν ζῴων (ἀνυπόδητόν τε γὰρ αὐτὸν εἶναί φασι καὶ γυμνὸν καὶ οὐκ ἔχοντα ὅπλον πρὸς τὴν ἀλκήν) οὐκ ὀρθῶς λέγουσιν.", "Plat. Protag. 321c", "Aristot. part. anim. 687a23-26"],
    ["διὰ ταῦτα καὶ τὸν τρόπον τῆς πράξεως τοῦ μισθοῦ τοιοῦτον πεποίημαι· ἐπειδὰν γάρ τις παρ’ ἐμοῦ μάθῃ, ἐὰν μὲν βούληται, ἀποδέδωκεν ὃ ἐγὼ πράττομαι ἀργύριον ἐὰν δὲ μή, ἐλθὼν εἰς ἱερόν, ὀμόσας ὅσου ἂν φῇ ἄξια εἶναι τὰ μαθήματα, τοσοῦτον κατέθηκε.", "ὅπερ φασὶ καὶ Πρωταγόραν ποιεῖν· ὅτε γὰρ διδάξειεν ἁδήποτε, τιμῆσαι τὸν μαθόντα ἐκέλευεν ὅσου δοκεῖ ἄξια ἐπίστασθαι, καὶ ἐλάμβανε τοσοῦτον. ἐν τοῖς τοιούτοις δ’ ἐνίοις ἀρέσκει τὸ “μισθὸς δ’ ἀνδρί.", "Plat. Protag. 328b-c", "Aristot. Eth. Nic. 1164a24-27"],
    ["οὐ γὰρ οὕτως ἀπαίδευτος ἦν Σιμωνίδης, ὥστε τούτους φάναι ἐπαινεῖν, ὃς ἂν ἑκὼν μηδὲν κακὸν ποιῇ, ὡς ὄντων τινῶν οἳ ἑκόντες κακὰ ποιοῦσιν.", "τὸ δὲ λέγειν ὡς οὐδεὶς ἑκὼν πονηρὸς οὐδ’ ἄκων μακάριος ἔοικε τὸ μὲν ψευδεῖ τὸ δ’ ἀληθεῖ.", "Plat. Protag. 345d", "Aristot. Eth. Nic. 1113b14-16"],
    ["κακὸς μὲν γὰρ ἑκὼν οὐδείς, διὰ δὲ πονηρὰν ἕξιν τινὰ τοῦ σώματος καὶ ἀπαίδευτον τροφὴν ὁ κακὸς γίγνεται κακός, παντὶ δὲ ταῦτα ἐχθρὰ καὶ ἄκοντι προσγίγνεται.", "τὸ δὲ λέγειν ὡς οὐδεὶς ἑκὼν πονηρὸς οὐδ’ ἄκων μακάριος ἔοικε τὸ μὲν ψευδεῖ τὸ δ’ ἀληθεῖ.", "Plat. Tim. 86d-e", "Aristot. Eth. Nic. 1113b14-16"],
    ["οὐδὲ ὡς περὶ τοιούτου αὐτοῦ ὄντος διανοοῦνται, ἀλλ’ ἐνούσης πολλάκις ἀνθρώπῳ ἐπιστήμης οὐ τὴν ἐπιστήμην αὐτοῦ ἄρχειν ἀλλ’ ἄλλο τι, τοτὲ μὲν θυμόν, τοτὲ δὲ ἡδονήν, τοτὲ δὲ λύπην, ἐνίοτε δὲ ἔρωτα, πολλάκις δὲ φόβον, ἀτεχνῶς διανοούμενοι περὶ τῆς ἐπιστήμης ὥσπερ περὶ ἀνδραπόδου, περιελκομένης ὑπὸ τῶν ἄλλων ἁπάντων.", "δεινὸν γὰρ ἐπιστήμης ἐνούσης, ὡς ᾤετο Σωκράτης, ἄλλο τι κρατεῖν καὶ περιέλκειν αὐτὴν ὥσπερ ἀνδράποδον.", "Plat. Protag. 352b-c", "Aristot. Eth. Nic. 1145b23-24"],
    ["Ἡ σοφία ἄρα τῶν δεινῶν καὶ μὴ δεινῶν ἀνδρεία ἐστίν, ἐναντία οὖσα τῇ τούτων ἀμαθίᾳ", "ἔστι δ’ εἴδη ἀνδρείας πέντε λεγόμενα καθ’ ὁμοιότητα· <τὰ> αὐτὰ γὰρ ὑπομένουσιν, ἀλλ’ οὐ διὰ τὰ αὐτά. μία μὲν πολιτική·αὕτη δ’ ἐστὶν ἡ δι’ αἰδῶ οὖσα. δευτέρα ἡ στρατιωτική· αὕτη δὲ δι’ἐμπειρίαν καὶ τὸ εἰδέναι, οὐχ ὥσπερ Σωκράτης ἔφη τὰ δεινά, ἀλλ’   ὅτι τὰς βοηθείας τῶν δεινῶν.", "Plat. Protag. 360d", "Aristot. Eth. Eud. 1229a12-16"],
    ["Ἡ σοφία δήπου, ἦν δ’ ἐγώ, εὐτυχία ἐστίν· τοῦτο δὲ κἂν παῖς γνοίη.", "οὐκ ἄρα ἔσται τύχης τοῦτο, ἀλλ’ ὅταν τὸ αὐτὸ ἀποβαίνῃ, ἀπείρων καὶ ἀορίστων, ἔσται μὲν τὸ ἀγαθὸν ἢ κακόν, ἐπιστήμη δ’ οὐκ ἔσται αὐτοῦ [ἢ] δι’ ἀπειρίαν, ἐπεὶ ἐμάνθανον ἄν τινες εὐτυχεῖν, ἢ καὶ πᾶσαι ἂν αἱ ἐπιστῆμαι, ὥσπερ ἔφη Σωκράτης, εὐτυχίαι ἦσαν.", "Plat. Euthyd. 279d", "Aristot. Eth. Eud. 1247b11-15"],
    ["Οὐ γὰρ μή ποτε τοῦτο δαμῇ, εἶναι μὴ ἐόντα, ἀλλὰ σὺ τῆσδ’ ἀφ’ ὁδοῦ διζήσιος εἶργε νόημα. ΘΕΑΙ. Λέγει γὰρ οὖν οὕτως. ΞΕ. Ἡμεῖς δέ γε οὐ μόνον τὰ μὴ ὄντα ὡς ἔστιν ἀπεδείξαμεν, ἀλλὰ καὶ τὸ εἶδος ὃ τυγχάνει ὂν τοῦ μὴ ὄντος ἀπεφηνάμεθα·", "ἔδοξε γὰρ αὐτοῖς πάντ’ ἔσεσθαι ἓν τὰ ὄντα, αὐτὸ τὸ ὄν, εἰ μή τις λύσει καὶ ὁμόσε βαδιεῖται τῷ Παρμενίδου λόγῳ “οὐ γὰρ μήποτε τοῦτο δαμῇ, εἶναι μὴ ἐόντα,” ἀλλ’ ἀνάγκη εἶναι τὸ μὴ ὂν δεῖξαι ὅτι ἔστιν· οὕτω γάρ, ἐκ τοῦ ὄντος καὶ ἄλλου τινός, τὰ ὄντα ἔσεσθαι, εἰ πολλά ἐστιν.", "Plat. Soph. 258d-e", "Aristot. metaph. 1089a2-6"],
    ["Τὸν μὲν δὴ φιλόσοφον ἐν τοιούτῳ τινὶ τόπῳ καὶ νῦν καὶ ἔπειτα ἀνευρήσομεν ἐὰν ζητῶμεν, ἰδεῖν μὲν χαλεπὸν ἐναργῶς καὶ τοῦτον, ἕτερον μὴν τρόπον ἥ τε τοῦ σοφιστοῦ χαλεπότης ἥ τε τούτου. ΘΕΑΙ. Πῶς; ΞΕ. Ὁ μὲν ἀποδιδράσκων εἰς τὴν τοῦ μὴ ὄντος σκοτεινότητα, τριβῇ προσαπτόμενος αὐτῆς, διὰ τὸ σκοτεινὸν τοῦ τόπου κατανοῆσαι χαλεπός· ἦ γάρ", "διὸ Πλάτων τρόπον τινὰ οὐ κακῶς τὴν σοφιστικὴν περὶ τὸ μὴ ὂν ἔταξεν. εἰσὶ γὰρ οἱ τῶν σοφιστῶν λόγοι περὶ τὸ συμβεβηκὸς ὡς εἰπεῖν μάλιστα πάντων πότερον ἕτερον ἢ ταὐτὸν μουσικὸν καὶ γραμματικόν, καὶ μουσικὸς Κορίσκος καὶ Κορίσκος, καὶ εἰ πᾶν ὃ ἂν ᾖ, μὴ ἀεὶ δέ, γέγονεν, ὥστ’ εἰ μουσικὸς ὢν γραμματικὸς γέγονε, καὶ γραμματικὸς ὢν μουσικός, καὶ ὅσοι δὴ ἄλλοι τοιοῦτοι τῶν λόγων  εἰσίν·", "Plat. Soph. 253e-254a", "Aristot. metaph. 1026b14-16"],
    ["ΞΕ. Ἄν τις ἄρα μὴ πείθων τὸν ἰατρευόμενον, ἔχων δὲ ὀρθῶς τὴν τέχνην, παρὰ τὰ γεγραμμένα τὸ βέλτιον ἀναγκάζῃ δρᾶν παῖδα ἤ τινα ἄνδρα ἢ καὶ γυναῖκα, τί τοὔνομα τῆς βίας ἔσται ταύτης", "τὸ δὲ τῶν τεχνῶν εἶναι δοκεῖ παράδειγμα ψεῦδος, ὅτι τὸ κατὰ γράμματα ἰατρεύεσθαι φαῦλον, ἀλλὰ αἱρετώτερον χρῆσθαι τοῖς ἔχουσι τὰς τέχνας.", "Plat. Polit. 296b", "Aristot. Polit. 1287a32-35"],
    ["διὸ γέγονε πασῶν μὲν νομίμων τῶν πολιτειῶν οὐσῶν τούτων χειρίστη, παρανόμων δὲ οὐσῶν συμπασῶν βελτίστη·", "ἐκεῖνος μὲν γὰρ ἔκρινε πασῶν μὲν οὐσῶν ἐπιεικῶν, οἷον ὀλιγαρχίας τε χρηστῆς καὶ τῶν ἄλλων, χειρίστην δημοκρατίαν, φαύλων δὲ ἀρίστην.", "Plat. Polit. 303a", "Aristot. Polit. 1289b6-8"],
    ["ΣΩ. Ὡς μὲν τοίνυν ἐκ τοῦ παραχρῆμα λέγειν, οἶμαί τι τοιοῦτον νοεῖν τοὺς τὴν ψυχὴν ὀνομάσαντας, ὡς τοῦτο ἄρα, ὅταν παρῇ τῷ σώματι, αἴτιόν ἐστι τοῦ ζῆν αὐτῷ, τὴν τοῦ ἀναπνεῖν δύναμιν παρέχον καὶ ἀναψῦχον, ἅμα δὲ ἐκλείποντος τοῦ ἀναψύχοντος τὸ σῶμα ἀπόλλυταί τε καὶ τελευτᾷ·ὅθεν δή μοι δοκοῦσιν αὐτὸ “ψυχὴν” καλέσαι.", "διὸ καὶ τοῖς ὀνόμασιν ἀκολουθοῦσιν, οἱ μὲν τὸ θερμὸν λέγοντες, ὅτι διὰ τοῦτο καὶ τὸ ζῆν ὠνόμασται, οἱ δὲ τὸ ψυχρόν, <διὰ τὸ> διὰ τὴν ἀναπνοὴν καὶ τὴν κατάψυξιν καλεῖσθαι ψυχήν. τὰ μὲν οὖν παραδεδομένα περὶ ψυχῆς, καὶ δι’ ἃς αἰτίας λέγουσιν οὕτω, ταῦτ’ ἐστίν.", "Plat. Crat. 399d-e", "Aristot. de anim. 405b26-30"],
    ["Οὐκ ἄρα ἐστὶν φίλον τῷ φιλοῦντι οὐδὲν μὴ οὐκ ἀντιφιλοῦν.", "τριῶν δ’ ὄντων δι’ ἃ φιλοῦσιν, ἐπὶ μὲν τῇ τῶν ἀψύχων φιλήσει οὐ λέγεται φιλία· οὐ γάρ ἐστιν ἀντιφίλησις, οὐδὲ βούλησις ἐκείνῳ ἀγαθοῦ (γελοῖον γὰρ ἴσως τῷ οἴνῳ βούλεσθαι τἀγαθά, ἀλλ’ εἴπερ, σῴζεσθαι βούλεται αὐτόν, ἵνα αὐτὸς  ἔχῃ)·", "Plat. Lys. 212d", "Aristot. Eth. Nic. 1155b27-31"],
    ["Ἀλλά μοι δοκοῦσιν λέγειν τοὺς ἀγαθοὺς ὁμοίους εἶναι ἀλλήλοις καὶ φίλους, τοὺς δὲ κακούς, ὅπερ καὶ λέγεται περὶ αὐτῶν, μηδέποτε ὁμοίους μηδ’ αὐτοὺς αὑτοῖς εἶναι, ἀλλ’ ἐμπλήκτους τε καὶ ἀσταθμήτους.", "οἱ δὲ μοχθηροὶ τὸ μὲν βέβαιον οὐκ ἔχουσιν· οὐδὲ γὰρ αὑτοῖς διαμέ-νουσιν ὅμοιοι ὄντες· ἐπ’ ὀλίγον δὲ χρόνον γίνονται φίλοι, χαίροντες τῇ ἀλλήλων μοχθηρίᾳ.", "Plat. Lys. 214c-d", "Aristot. Eth. Nic. 1159b7-10"],
    ["ἐμπειρία μὲν γὰρ ποιεῖ τὸν αἰῶνα ἡμῶν πορεύεσθαι κατὰ τέχνην, ἀπειρία δὲ κατὰ τύχην.", "ἡ μὲν γὰρ ἐμπειρία τέχνην ἐποίησεν, ὡς φησὶ Πῶλος, ἡ δ’ ἀπειρία τύχην.", "Plat. Gorg. 448c", "Aristot. Metaph. 981a3-5"],
    ["δέος γὰρ εἶναι προσδοκίαν μέλλοντος κακοῦ —ἢ οὐχ οὕτω καὶ συνδοκεῖ, ὦ Λάχης", "φοβούμεθα δὲ δῆλον ὅτι τὰ φοβερά, ταῦτα δ’ ἐστὶν ὡς ἁπλῶς εἰπεῖν κακά· διὸ καὶ τὸν φόβον ὁρίζονται προσδοκίαν κακοῦ.", "Plat. Lach. 198b", "Aristot. Eth. Nic. 1115a6-9"],
    ["Καὶ ἡ ὄψις γέ που, ὦ ἄριστε, εἴπερ ὄψεται αὐτὴ ἑαυτήν, χρῶμά τι αὐτὴν ἀνάγκη ἔχειν·", "εἰ γὰρ τὸ τῇ ὄψει αἰσθάνεσθαί ἐστιν ὁρᾶν, ὁρᾶται δὲ χρῶμα ἢ τὸ ἔχον, εἰ ὄψεταί τις τὸ ὁρῶν, καὶ χρῶμα ἕξει τὸ ὁρῶν πρῶτον.", "Plat Charm. 168d-e", "Aristot. de anim. 425b17-20"],
    ["Τοῦ μεγίστου ἄρα ἀγαθοῦ τῇ πόλει αἰτία ἡμῖν πέφανται ἡ κοινωνία τοῖς ἐπικούροις τῶν τε παίδων καὶ τῶν γυναικῶν.", "ἐνδέχεται γὰρ καὶ τέκνων καὶ γυναικῶν καὶ κτημάτων κοινωνεῖν τοὺς πολίτας ἀλλήλοις, ὥσπερ ἐν τῇ Πολιτείᾳ τῇ Πλάτωνος·", "Plat. resp. 464b", "Aristot. Polit. 1261a4-6"],
    ["Ἔχομεν οὖν τι μεῖζον κακὸν πόλει ἢ ἐκεῖνο ὃ ἂν αὐτὴν διασπᾷ καὶ ποιῇ πολλὰς ἀντὶ μιᾶς", "φανερὸν τοίνυν ἐκ τούτων ὡς οὔτε πέφυκε μίαν οὕτως εἶναι τὴν πόλιν ὥσπερ λέγουσί τινες, καὶ τὸ λεχθὲν ὡς μέγιστον ἀγαθὸν ἐν ταῖς πόλεσιν ὅτι τὰς πόλεις ἀναιρεῖ.", "Plat. resp. 462a-b", "Aristot. Polit. 1261b6-9"],
    ["Πασῶν ἄρα πόλεων μάλιστα ἐν αὐτῇ συμφωνήσουσιν ἑνός τινος ἢ εὖ ἢ κακῶς πράττοντος ὃ νυνδὴ ἐλέγομεν τὸ ῥῆμα, τὸ ὅτι τὸ ἐμὸν εὖ πράττει ἢ ὅτι τὸ ἐμὸν κακῶς.", "ἔτι οὕτως ἕκαστος “ἐμὸς” λέγει τὸν εὖ πράττοντα τῶν πολιτῶν ἢ κακῶς, ὁπόστος τυγχάνει τὸν ἀριθμὸν ὤν, οἷον ἐμὸς ἢ τοῦ δεῖνος, τοῦτον τὸν τρόπον λέγων καθ’ ἕκαστον τῶν χιλίων, ἢ ὅσων ἡ πόλις ἐστί, καὶ τοῦτο διστάζων·", "Plat. resp. 463e", "Aristot. Polit. 1262a1-5"],
    ["Οὐκοῦν καὶ φειδωλοὶ χρημάτων, ἅτε τιμῶντες καὶ οὐ  φανερῶς κτώμενοι, φιλαναλωταὶ δὲ ἀλλοτρίων δι’ ἐπιθυμίαν, καὶ λάθρᾳ τὰς ἡδονὰς καρπούμενοι, ὥσπερ παῖδες πατέρα τὸν νόμον ἀποδιδράσκοντες, οὐχ ὑπὸ πειθοῦς ἀλλ’ ὑπὸ βίας πεπαιδευμένοι διὰ τὸ τῆς ἀληθινῆς Μούσης τῆς μετὰ λόγων τε καὶ φιλοσοφίας ἠμεληκέναι καὶ πρεσβυτέρως γυμναστικὴν μουσικῆς τετιμηκέναι.", "αὐτὴ μὲν γὰρ ἀνειμένη λίαν ἐστίν, ἐν δὲ τοῖς ἄλλοις μᾶλλον ὑπερβάλλει ἐπὶ τὸ σκληρόν, ὥστε μὴ δύνασθαι καρτερεῖν ἀλλὰ λάθρᾳ τὸν νόμον ἀποδιδράσκοντας ἀπολαύειν τῶν σωματικῶν ἡδονῶν.", "Plat. resp. 548b-c", "Aristot. Polit. 1270b31-35"],
    ["δεῖ δὴ πάντ’ ἄνδρα διανοεῖσθαι περὶ ἁπάντων ἀνθρώπων ὡς ὁ μὴ δουλεύσας οὐδ’ ἂν δεσπότης γένοιτο ἄξιος ἐπαίνου, καὶ καλλωπίζεσθαι χρὴ τῷ καλῶς δουλεῦσαι μᾶλλον ἢ τῷ καλῶς ἄρξαι , πρῶτον μὲν τοῖς νόμοις, ὡς ταύτην τοῖς θεοῖς οὖσαν δουλείαν, ἔπειτ’ ἀεὶ τοῖς πρεσβυτέροις τε καὶ ἐντίμως βεβιωκόσι τοὺς νέους.", "διὸ λέγεται καὶ τοῦτο καλῶς, ὡς οὐκ ἔστιν εὖ ἄρξαι μὴ ἀρχθέντα.", "Plat. Leg. 762e", "Aristot. Polit. 1277b11-13"],
    ["ἐπειδὴ δὲ ταύτης ἐστερήθην καὶ οὔτ’ αὐτὸς εὑρεῖν οὔτε παρ’ ἄλλου μαθεῖν οἷός τε ἐγενόμην, τὸν δεύτερον πλοῦν ἐπὶ τὴν τῆς αἰτίας ζήτησιν ᾗ πεπραγμάτευμαι βούλει σοι, ἔφη, ἐπίδειξιν ποιήσωμαι, ὦ Κέβης", "ἐπεὶ οὖν τοῦ μέσου τυχεῖν ἄκρως χαλεπόν, κατὰ τὸν δεύτερον, φασί, πλοῦν τὰ ἐλάχιστα ληπτέον τῶν κακῶν.", "Plat. Phaed. 99c-d", "Aristot. Eth. Nicom. 1109a34-35"],
    ["καὶ οὕτω πόρρω εἶ περί τε τοῦ δικαίου καὶ δικαιοσύνης καὶ ἀδίκου τε καὶ ἀδικίας, ὥστε ἀγνοεῖς ὅτι ἡ μὲν δικαιοσύνη καὶ τὸ δίκαιον ἀλλότριον ἀγαθὸν τῷ ὄντι, τοῦ κρείττονός τε καὶ ἄρχοντος συμφέρον, οἰκεία δὲ τοῦ πειθομένου τε καὶ ὑπηρετοῦντος βλάβη, ἡ δὲ ἀδικία τοὐναντίον, καὶ ἄρχει τῶν ὡς ἀληθῶς εὐηθικῶν τε καὶ δικαίων, οἱ δ’ ἀρχόμενοι ποιοῦσιν τὸ ἐκείνου συμφέρον κρείττονος ὄντος, καὶ εὐδαίμονα ἐκεῖνον ποιοῦσιν ὑπηρετοῦντες αὐτῷ, ἑαυτοὺς δὲ οὐδ’ ὁπωστιοῦν.", "διὰ δὲ τὸ αὐτὸ τοῦτο καὶ ἀλλότριον ἀγαθὸν δοκεῖ εἶναι ἡ δικαιοσύνη μόνη τῶν ἀρετῶν, ὅτι πρὸς ἕτερόν ἐστιν.", "Plat. resp. 343c", "Aistot. Eth. Nicom. 1130a3-4"],
    ["“σωφροσύνη” δὲ σωτηρία οὗ νυνδὴ ἐσκέμμεθα, φρονήσεως.", "ἔνθεν καὶ τὴν σωφροσύνην τούτῳ προσαγορεύομεν τῷ ὀνόματι, ὡς σῴζουσαν τὴν φρόνησιν.", "Plat. Crat. 411e-412a", "Aristot. Eth. Nicom. 1140b11-12"],
    ["νεανίσκος τις Παιανιεύς, μάλα καλός τε κἀγαθὸς τὴν φύσιν, ὅσον μὴ ὑβριστὴς [δὲ] διὰ τὸ νέος εἶναι.", "αἴτιον δὲ τῆς ἡδονῆς τοῖς ὑβρίζουσιν, ὅτι οἴονται κακῶς δρῶντες αὐτοὶ ὑπερέχειν μᾶλλον (διὸ οἱ νέοι καὶ οἱ πλούσιοι ὑβρισταί· ὑπερέχειν γὰρ οἴονται ὑβρίζοντες).", "Plat. Euthyd. 273a", "Aristot. Rhet. 1378b26-29"],
    ["κινδυνεύει μὲν γὰρ ἡμῶν οὐδέτερος οὐδὲν καλὸν κἀγαθὸν εἰδέναι, ἀλλ’ οὗτος μὲν οἴεταί τι εἰδέναι οὐκ εἰδώς,  ἐγὼ δέ, ὥσπερ οὖν οὐκ οἶδα, οὐδὲ οἴομαι·", "καὶ οἴονται, ἴσασι δ’ οὐδέν, καὶ ἀμφιδοξοῦντες προστιθέασιν ἀεὶ τὸ ἴσως καὶ τάχα, καὶ πάντα λέγουσιν οὕτως, παγίως δ’ οὐδέν.", "Plat. Apol. 21d", "Aristot. Rhet. 1389b18-20"],
    ["τοιγάρτοι διὰ ταῦτα δίκην αὐτῷ ἐπέθεσαν, καὶ ἐποίησαν τὸν θάνατον αὐτοῦ ὑπὸ γυναικῶν γενέσθαι, οὐχ ὥσπερ Ἀχιλλέα τὸν τῆς Θέτιδος ὑὸν ἐτίμησαν καὶ εἰς μακάρων νήσους ἀπέπεμψαν, ὅτι πεπυσμένος παρὰ τῆς μητρὸς ὡς ἀποθανοῖτο ἀποκτείνας Ἕκτορα, μὴ ποιήσας δὲ τοῦτο οἴκαδε ἐλθὼν γηραιὸς τελευτήσοι, ἐτόλμησεν ἑλέσθαι βοηθήσας τῷ ἐραστῇ Πατρόκλῳ καὶ τιμωρήσας οὐ μόνον ὑπεραποθανεῖν ἀλλὰ καὶ ἐπαποθανεῖν τετελευτηκότι.", "ὁμοίως δὲ καὶ οἱ ἐπαινοῦντες καὶ οἱ ψέγοντες οὐ σκοποῦσιν εἰ συμφέροντα ἔπραξεν ἢ βλαβερά, ἀλλὰ καὶ ἐν ἐπαίνῳ  πολλάκις τιθέασιν ὅτι ὀλιγωρήσας τοῦ αὑτῷ λυσιτελοῦντος  ἔπραξεν ὅ τι καλόν, οἷον Ἀχιλλέα ἐπαινοῦσιν ὅτι ἐβοήθησε τῷ ἑταίρῳ Πατρόκλῳ εἰδὼς ὅτι δεῖ αὐτὸν ἀποθανεῖν ἐξὸν ζῆν.", "Plat. Symp. 179e-180a", "Aristot. Rhet. 1358b26-1359a5"],
    ["οὐ γὰρ οἶμαι συμφέρει τοῖς ἄρχουσι φρονήματα μεγάλα ἐγγίγνεσθαι τῶν ἀρχομένων, οὐδὲ φιλίας ἰσχυρὰς καὶ κοινωνίας, ὃ δὴ μάλιστα φιλεῖ τά τε ἄλλα πάντα καὶ ὁ ἔρως ἐμποιεῖν. ἔργῳ δὲ τοῦτο ἔμαθον καὶ οἱ ἐνθάδε τύραννοι· ὁ γὰρ Ἀριστογείτονος ἔρως καὶ ἡ Ἁρμοδίου φιλία βέβαιος γενομένη κατέλυσεν αὐτῶν τὴν ἀρχήν.", "οἷον εἴ τις λέγοι “ταῖς πόλεσι συμφέρουσιν οἱ ἐρῶντες· ὁ γὰρ Ἁρμοδίου καὶ Ἀριστογείτονος ἔρως κατέλυσε τὸν τύραννον Ἵππαρχον” ἢ εἴ τις λέγοι ὅτι κλέπτης Διονύσιος·", "Plat. Symp. 182b-c", "Aristot. Rhet. 1401b10-13"],
    ["ΞΕ. Ταύτην δὲ ὁ κεκτημένος οὐκ, ἄντε ἄρχων ἄντε ἰδιώτης ὢν τυγχάνῃ, πάντως κατά γε τὴν τέχνην αὐτὴν βασιλικὸς ὀρθῶς προσρηθήσεται; ΝΕ. ΣΩ. Δίκαιον γοῦν. ΞΕ. Καὶ μὴν οἰκονόμος γε καὶ δεσπότης ταὐτόν.", "ὅσοι μὲν οὖν οἴονται πολιτικὸν καὶ βασιλικὸν καὶ οἰκονομικὸν καὶ δεσποτικὸν εἶναι τὸν αὐτὸν οὐ καλῶς λέγουσιν (πλήθει γὰρ καὶ ὀλιγότητι νομίζουσι διαφέρειν ἀλλ’ οὐκ εἴδει τούτων ἕκαστον, οἷον ἂν μὲν ὀλίγων, δεσπότην, ἂν δὲ πλειόνων, οἰκονόμον, ἂν δ’ ἔτι πλειόνων, πολιτικὸν ἢ βασιλικόν, ὡς οὐδὲν διαφέρουσαν μεγάλην οἰκίαν ἢ μικρὰν πόλιν·", "Plat. Polit. 259b", "Aristot. Polit. 1252a7-13"],
    ["μεγάλης σχῆμα οἰκήσεως ἢ σμικρᾶς αὖ πόλεως ὄγκος μῶν τι πρὸς ἀρχὴν διοίσετον; ΝΕ. ΣΩ. Οὐδέν.", "ὅσοι μὲν οὖν οἴονται πολιτικὸν καὶ βασιλικὸν καὶ οἰκονομικὸν καὶ δεσποτικὸν εἶναι τὸν αὐτὸν οὐ καλῶς λέγουσιν (πλήθει γὰρ καὶ ὀλιγότητι νομίζουσι διαφέρειν ἀλλ’ οὐκ εἴδει τούτων ἕκαστον, οἷον ἂν μὲν ὀλίγων, δεσπότην, ἂν δὲ πλειόνων, οἰκονόμον, ἂν δ’ ἔτι πλειόνων, πολιτικὸν ἢ βασιλικόν, ὡς οὐδὲν διαφέρουσαν μεγάλην οἰκίαν ἢ μικρὰν πόλιν·", "Plat. Politic. 259b-c", "Aristot. Polit. 1252a7-13"],
    ["Οὐκοῦν, ὃ νυνδὴ διεσκοπούμεθα, φανερὸν ὡς ἐπιστήμη μία περὶ πάντ’ ἐστὶ ταῦτα· ταύτην δὲ εἴτε βασιλικὴν εἴτε πολιτικὴν εἴτε οἰκονομικήν τις ὀνομάζει, μηδὲν αὐτῷ διαφερώμεθα.", "ὅσοι μὲν οὖν οἴονται πολιτικὸν καὶ βασιλικὸν καὶ οἰκονομικὸν καὶ δεσποτικὸν εἶναι τὸν αὐτὸν οὐ καλῶς λέγουσιν (πλήθει γὰρ καὶ ὀλιγότητι νομίζουσι διαφέρειν ἀλλ’ οὐκ εἴδει τούτων ἕκαστον, οἷον ἂν μὲν ὀλίγων, δεσπότην, ἂν δὲ πλειόνων, οἰκονόμον, ἂν δ’ ἔτι πλειόνων, πολιτικὸν ἢ βασιλικόν, ὡς οὐδὲν διαφέρουσαν μεγάλην οἰκίαν ἢ μικρὰν πόλιν·", "Plat. Polit. 259c", "Aristot. Polit. 1252a7-13"],
    ["καὶ οὔτε ὡς ἀθάνατος πέφυκεν οὔτε ὡς θνητός, ἀλλὰ τοτὲ μὲν τῆς αὐτῆς ἡμέρας θάλλει τε καὶ ζῇ, ὅταν εὐπορήσῃ, τοτὲ δὲ ἀποθνῄσκει, πάλιν δὲ ἀναβιώσκεται διὰ τὴν τοῦ πατρὸς φύσιν, τὸ δὲ ποριζόμενον ἀεὶ ὑπεκρεῖ, ὥστε οὔτε ἀπορεῖ Ἔρως ποτὲ οὔτε πλουτεῖ, σοφίας τε αὖ καὶ ἀμαθίας ἐν μέσῳ ἐστίν.", "οὐ θνητὸς οὐδ’ ἀθάνατος, ἀλλ’ ἔχων τινὰ σύγκρασιν, ὥστε μήτ’ ἐν ἀνθρώπου μέρει μήτ’ ἐν θεοῦ ζῆν, ἀλλὰ φύεσθαι τ’ ἀεὶ καινῶς φθίνειν τε τὴν παρουσίαν πάλιν ἀόρατος ὄψιν, γνώριμος δ’ ἅπασιν ὤν.", "Platon, Symposium 203d-e", "Alexis fr. 240 Kock (II. 385)"],
    ["καὶ οὔτε ὡς ἀθάνατος πέφυκεν οὔτε ὡς θνητός, ἀλλὰ τοτὲ μὲν τῆς αὐτῆς ἡμέρας θάλλει τε καὶ ζῇ, ὅταν εὐπορήσῃ, τοτὲ δὲ ἀποθνῄσκει, πάλιν δὲ ἀναβιώσκεται διὰ τὴν τοῦ πατρὸς φύσιν, τὸ δὲ ποριζόμενον ἀεὶ ὑπεκρεῖ, ὥστε οὔτε ἀπορεῖ Ἔρως ποτὲ οὔτε πλουτεῖ, σοφίας τε αὖ καὶ ἀμαθίας ἐν μέσῳ ἐστίν.", "ἔστιν γὰρ οὔτε θῆλυς οὔτ’ ἄρρην, πάλιν οὔτε θεὸς οὔτε ἄνθρωπος οὔτ’ αὖθις ἔμφρων, ἀλλὰ συνενηνεγμένος πανταχόθεν, ἑνὶ τύπῳ τε πόλλ’ εἴδη φέρων.", "Platon, Symposium 203d8", "Alexis fr. 245 Kock,  6ff. (II. 86f.)"],
    ["εἰ γὰρ ὀρθῶς ἐλέγομεν ἄρτι, καὶ τῷ ὄντι θεοῖσι μὲν ἄχρηστον ψεῦδος, ἀνθρώποις δὲ χρήσιμον ὡς ἐν φαρμάκου εἴδει, δῆλον ὅτι τό γε τοιοῦτον ἰατροῖς δοτέον, ἰδιώταις δὲ οὐχ ἁπτέον. Δῆλον, ἔφη.", "τὸ δὲ δεῖν παντάπασιν ἀποδοκιμάζειν τῶν λόγων τὴν ἑτοιμότητα ἢ πάλιν αὖ ταύτην οὐκ ἐπ’ ἀξίοις ἀσκεῖν οὐ φαίην ἂν ἔγωγε, ἀλλ᾽ ὡς ἐν φαρμάκου μοίρᾳ τοῦτο ποιητέον ἐστί.", "Plat. rep. III, 389b", "Plut. Mor. 6e"],
    ["δυοῖν ὄντοιν τοῖν πραγμάτοιν δύο λέγω τέχνας: τὴν μὲν ἐπὶ τῇ ψυχῇ πολιτικὴν καλῶ, τὴν δὲ ἐπὶ σώματι μίαν μὲν οὕτως ὀνομάσαι οὐκ ἔχω σοι, μιᾶς δὲ οὔσης τῆς τοῦ σώματος θεραπείας δύο μόρια λέγω, τὴν μὲν γυμναστικήν, τὴν δὲ ἰατρικήν", "περὶ μὲν γὰρ τὴν τοῦ σώματος ἐπιμέλειαν διττὰς εὗρον ἐπιστήμας οἱ ἄνθρωποι, τὴν ἰατρικὴν καὶ τὴν γυμναστικήν, ὧν ἡ μὲν τὴν ὑγίειαν, ἡ δὲ τὴν εὐεξίαν ἐντίθησι.", "Plat. Gorg. 464b", "Plut. mor. 7d"],
    ["πλούσιοι δὴ οἶμαι οἱ τοιοῦτοι καλοῦνται κηφήνων βοτάνη.", "οὕτως οὖν δεῖ τὸν φιλότεχνον καὶ καθαρὸν ἀκροατὴν τὰ μὲν ἀνθηρὰ καὶ τρυφερὰ τῶν ὀνομάτων καὶ τῶν πραγμάτων τὰ δραματικὰ καὶ πανηγυρικὰ κηφήνων βοτάνην σοφιστιώντων ἡγούμενον ἐᾶν, αὐτὸν δὲ τῇ προσοχῇ καταδυόμενον εἰς τὸν νοῦν τοῦ λόγου καὶ τὴν διάθεσιν τοῦ λέγοντος ἕλκειν ἀπ’ αὐτῆς τὸ χρήσιμον καὶ ὠφέλιμον, μεμνημένον ὡς οὐκ εἰς θέατρον οὐδ’ ᾠδεῖον ἀλλ’ εἰς σχολὴν καὶ διδασκαλεῖον ἀφῖκται, τῷ λόγῳ τὸν βίον ἐπανορθωσόμενος.", "Plat. rep. VIII, 564e", "Plut. mor. 41f-42a"],
    ["Οὐκοῦν ὅταν μέν τις μουσικῇ παρέχῃ καταυλεῖν καὶ καταχεῖν τῆς ψυχῆς διὰ τῶν ὤτων ὥσπερ διὰ χώνης ἃς νυνδὴ ἡμεῖς ἐλέγομεν τὰς γλυκείας τε καὶ μαλακὰς καὶ θρηνώδεις ἁρμονίας καὶ μινυρίζων τε καὶ γεγανωμένος ὑπὸ τῆς ᾠδῆς διατελῇ τὸν βίον ὅλον οὗτος τὸ μὲν πρῶτον, εἴ  τι θυμοειδὲς εἶχεν, ὥσπερ σίδηρον ἐμάλαξεν καὶ χρήσιμον ἐξ ἀχρήστου καὶ σκληροῦ ἐποίησεν·", "οὐ δεῖ δὲ τὸ ἡδὺ τῆς ἀκροάσεως ποιεῖσθαι τέλος, οὐδ´ οἴεσθαι δεῖν ἐκ σχολῆς ἀπιέναι φιλοσόφου μινυρίζοντα καὶ γεγανωμένον οὐδὲ ζητεῖν μυρίζεσθαι δεόμενον ἐμβροχῆς καὶ καταπλάσματος, ἀλλὰ χάριν ἔχειν, ἄν τις ὥσπερ καπνῷ σμῆνος λόγῳ δριμεῖ τὴν διάνοιαν ἀχλύος πολλῆς καὶ ἀμβλύτητος γέμουσαν ἐκκαθήρῃ.", "Plat. rep. III, 411a-b", "Plut. mor. 42c"],
    ["τῷ δὲ ἀεὶ συνέπεται δίκη τῶν ἀπολειπομένων τοῦ θείου νόμου τιμωρός, ἧς ὁ μὲν εὐδαιμονήσειν μέλλων ἐχόμενος συνέπεται ταπεινὸς καὶ κεκοσμημένος ὁ δέ τις ἐξαρθεὶς ὑπὸ μεγαλαυχίας, ἢ χρήμασιν ἐπαιρόμενος ἢ τιμαῖς, ἢ καὶ σώματος εὐμορφίᾳ ἅμα νεότητι καὶ ἀνοίᾳ φλέγεται τὴν ψυχὴν μεθ’ ὕβρεως, ὡς οὔτε ἄρχοντος οὔτε τινὸς ἡγεμόνος δεόμενος, ἀλλὰ καὶ ἄλλοις ἱκανὸς ὢν ἡγεῖσθαι, καταλείπεται ἔρημος θεοῦ, καταλειφθεὶς δὲ καὶ ἔτι ἄλλους τοιούτους προσλαβὼν σκιρτᾷ ταράττων πάντα ἅμα, καὶ πολλοῖς τισιν ἔδοξεν εἶναί τις, μετὰ δὲ χρόνον οὐ πολὺν ὑποσχὼν τιμωρίαν οὐ μεμπτὴν τῇ δίκῃ ἑαυτόν τε καὶ οἶκον καὶ πόλιν ἄρδην ἀνάστατον ἐποίησεν.", "ὁ δ’ ἐντὸς γενόμενος καὶ μέγα φῶς ἰδών, οἷον ἀνακτόρων ἀνοιγομένων, ἕτερον λαβὼν σχῆμα καὶ σιωπὴν καὶ θάμβος ὥσπερ θεῷ τῷ λόγῳ ταπεινὸς ξυνέπεται καὶ κεκοσμημένος.", "Plat. leg. IV, 716a-b", "Plut. Mor. 81e"],
    ["ἆρ’ οὐ νομοθετήσομεν πρῶτον μὲν τοὺς παῖδας μέχρι ἐτῶν ὀκτωκαίδεκα τὸ παράπαν οἴνου μὴ γεύεσθαι,  διδάσκοντες ὡς οὐ χρὴ πῦρ ἐπὶ πῦρ ὀχετεύειν εἴς τε τὸ σῶμα καὶ τὴν ψυχήν πρὶν ἐπὶ τοὺς πόνους ἐγχειρεῖν πορεύεσθαι, τὴν ἐμμανῆ εὐλαβουμένους ἕξιν τῶν νέων·", "τότ’ οὖν δεῖ μάλιστα τὴν νοῦν ἔχουσαν ἀποκλείειν τὰ ὦτα καὶ φυλάττεσθαι τὸν ψιθυρισμόν, ἵνα μὴ πῦρ ἐπὶ πῦρ γένηται καὶ πρόχειρον ἔχειν τὸ τοῦ Φιλίππου.", "Plat. leg. II, 666a", "Plut. Mor. 143f"],
    ["εἰ γὰρ τούτου ἐπιθυμεῖτε, θέλω ὑμᾶς συντῆξαι καὶ συμφυσῆσαι εἰς τὸ αὐτό, ὥστε δύ’ ὄντας ἕνα γεγονέναι καὶ ἕως τ’ ἂν ζῆτε, ὡς ἕνα ὄντα, κοινῇ ἀμφοτέρους ζῆν, καὶ ἐπειδὰν ἀποθάνητε, ἐκεῖ αὖ ἐν Ἅιδου ἀντὶ δυοῖν ἕνα εἶναι κοινῇ τεθνεῶτε·", "ἔστι δὲ τῆς μὲν πρὸς γυναῖκας ἀνδρῶν ὁμοφροσύνης καὶ φιλίας δημιουργὸς ἡ Ἀφροδίτη, τοῖς σώμασιν ὑφ᾽ ἡδονῆς ἅμα συμμιγνύουσα καὶ συντήκουσα τὰς ψυχάς", "Plat. symp. 192d-e", "Plut. Mor. 156c-d"],
    ["καὶ γὰρ πᾶν τὸ δαιμόνιον μεταξύ ἐστι θεοῦ τε καὶ θνητοῦ.", "ἐμοὶ δὲ δοκοῦσι πλείονας λῦσαι καὶ μείζονας ἀπορίας οἱ τὸ τῶν δαιμόνων γένος ἐν μέσῳ θεῶν καὶ ἀνθρώπων τρόποv τινὰ τὴν κοινωνίαν ἡμῶν συνάγον εἰς ταὐτὸ καὶ συνάπτον ἐξευρόντες", "Plat. symp. 202d-e", "Plut. Mor. 415a"],
    ["ἀτεχνῶς γὰρ λευκὴ στάθμη εἰμὶ πρὸς τοὺς καλούς —σχεδὸν γάρ τί μοι πάντες οἱ ἐν τῇ ἡλικίᾳ καλοὶ φαίνονται—ἀτὰρ οὖν δὴ καὶ  τότε ἐκεῖνος ἐμοὶ θαυμαστὸς ἐφάνη τό τε μέγεθος καὶ τὸ κάλλος, οἱ δὲ δὴ ἄλλοι πάντες ἐρᾶν ἔμοιγε ἐδόκουν αὐτοῦ— οὕτως ἐκπεπληγμένοι τε καὶ τεθορυβημένοι ἦσαν, ἡνίκ’ εἰσῄει—πολλοὶ δὲ δὴ ἄλλοι ἐρασταὶ καὶ ἐν τοῖς ὄπισθεν εἵποντο.", "ἔστι μὲν οὖν ἀτεχνῶς ἡ λευκὴ στάθμη πρὸς τοὺς λόγους ὁ ἀδόλεσχος", "Plat. Charm. 154b", "Plut. Mor. 513e-514a"],
    ["ἄκουε δή, φασί, μάλα καλοῦ λόγου, ὃν σὺ μὲν ἡγήσῃ μῦθον, ὡς ἐγὼ οἶμαι, ἐγὼ δὲ λόγον", "ὅτι δ’ οὐκ ἔστιν αἰσχίων οὐδὲ λυποῦσα μᾶλλον ἑτέρα κόλασις ἢ τοὺς ἐξ ἑαυτῶν κακὰ  πάσχοντας δι’ αὑτοὺς ὁρᾶν, καὶ ὅτι ψυχὴν ἀνδρὸς ἀσεβοῦς καὶ παρανόμου μετὰ θάνατον ἐφορῶσαν οὐκ ἀνδριάντας οὐδὲ τιμάς τινας ἀνατρεπομένας ἀλλὰ παῖδας ἢ φίλους ἢ γένος οἰκεῖον αὑτῆς ἀτυχήμασι χρωμένους μεγάλοις δι’ αὑτὴν καὶ δίκην τίνοντας οὐδεὶς ἂν ἀναπείσειεν αὖθις ἐπὶ ταῖς τοῦ Διὸς τιμαῖς ἄδικον γενέσθαι καὶ ἀκόλαστον,  ἔχω μέν τινα καὶ λόγον εἰπεῖν ἔναγχος ἀκηκοώς, ὀκνῶ δὲ μὴ φανῇ μῦθος ὑμῖν", "Plat. Gorg. 523a", "Plut. Mor. 561a-b"],
    ["παγκάλους, ἔφη, τοὺς ἄρχοντας, ὦ Σώκρατες, ὥσπερ ἀνδριαντοποιὸς ἀπείργασαι", "τοιοῦτον’ ἔφη ‘σοι, Θέων, ἐγὼ τὸν ἄρχοντα συμποσίου πλάσας ὥσπερ ἐκ κηροῦ τοῦ λόγου παραδίδωμι.’", "Plat. rep. VII, 540c", "Plut. Mor. 621b"],
    ["ταῦτά τε δή, ἔφην, ἔχοι ἂν καὶ τούτων ἄλλα ἀδελφὰ δημοκρατία, καὶ εἴη, ὡς ἔοικεν, ἡδεῖα πολιτεία καὶ ἄναρχος καὶ ποικίλη, ἰσότητά τινα ὁμοίως ἴσοις τε καὶ ἀνίσοις διανέμουσα.", "οὐχ ὥσπερ ἡ τοῦ κρέως καὶ τοῦ ἄρτου μερὶς ἀδικωτάτῳ μέτρῳ καλλωπίζεται τῷ ἴσῳ πρὸς ἀνίσους.", "Plat. rep. VIII, 558c", "Plut. Mor. 643b"],
    ["μάλα γὰρ φιλοσόφου τοῦτο τὸ πάθος, τὸ θαυμάζειν: οὐ γὰρ ἄλλη ἀρχὴ φιλοσοφίας ἢ αὕτη καὶ ἔοικεν ὁ τὴν Ἶριν Θαύμαντος ἔκγονον φήσας οὐ κακῶς γενεαλογεῖν.", "ὅπου γὰρ ὁ τῆς αἰτίας ἐπιλείπει λόγος, ἐκεῖθεν ἄρχεται τὸ ἀπορεῖν, τουτέστι τὸ φιλοσοφεῖν", "Plat. Tht. 155d", "Plut. Mor. 680c-d"],
    ["καὶ τούτων δὴ τῶν ὀλίγων οἱ γενόμενοι καὶ γευσάμενοι ὡς ἡδὺ καὶ μακάριον τὸ κτῆμα, καὶ τῶν πολλῶν αὖ ἱκανῶς ἰδόντες τὴν μανίαν, καὶ ὅτι οὐδεὶς οὐδὲν  ὑγιὲς ὡς ἔπος εἰπεῖν περὶ τὰ τῶν πόλεων πράττει οὐδ’ ἔστι σύμμαχος μεθ’ ὅτου τις ἰὼν ἐπὶ τὴν τῷ δικαίῳ βοήθειαν σῴζοιτ’ ἄν, ἀλλ’ ὥσπερ εἰς θηρία ἄνθρωπος ἐμπεσών, οὔτε συναδικεῖν ἐθέλων οὔτε ἱκανὸς ὢν εἷς πᾶσιν ἀγρίοις ἀντέχειν, πρίν τι τὴν πόλιν ἢ φίλους ὀνῆσαι προαπολόμενος ἀνωφελὴς αὑτῷ τε καὶ τοῖς ἄλλοις ἂν γένοιτο—ταῦτα πάντα λογισμῷ λαβών, ἡσυχίαν ἔχων καὶ τὰ αὑτοῦ πράττων,  οἷον ἐν χειμῶνι κονιορτοῦ καὶ ζάλης ὑπὸ πνεύματος φερομένου ὑπὸ τειχίον ἀποστάς ὁρῶν τοὺς ἄλλους καταπιμπλαμένους ἀνομίας, ἀγαπᾷ εἴ πῃ αὐτὸς καθαρὸς ἀδικίας τε καὶ ἀνοσίων ἔργων τόν τε ἐνθάδε βίον βιώσεται καὶ τὴν ἀπαλλαγὴν αὐτοῦ μετὰ καλῆς ἐλπίδος ἵλεώς τε καὶ εὐμενὴς ἀπαλλάξεται.", "ταυτὶ δὲ πρεσβύτης γενόμενος  ’ἔργα δὲ Κυπρογενοῦς νῦν μοι φίλα καὶ Διονύσου // καὶ Μουσέων, ἃ τίθησ’ ἀνδράσιν εὐφροσύνασ’, ὥσπερ ἐκ ζάλης καὶ χειμῶνος καὶ τῶν παιδικῶν ἐρώτων ἔν τινι γαλήνῃ τῇ περὶ γάμον καὶ φιλοσοφίαν θέμενος τὸν βίον.", "Plat. rep. 496c-e", "Plut. Mor. 751e"],
    ["σὺ γὰρ ἐμοὶ ὧντινων μὲν καὶ ὅπως ἤκουσας μηδ᾽ ἂν κελεύω εἴπῃς τοῦτο δὲ αὐτὸ ὃ λέγεις ποίησον·", "τὰ μὲν οὖν ‘ἀριζήλως εἰρημένα’ Πλάτωνι, μᾶλλον δὲ ταῖς θεαῖς ταύταις διὰ Πλάτωνος, ὦγαθέ ‘μηδ᾽ ἂν κελεύωμεν εἴπῃς", "Plat. Phaidr. 235d", "Plut. Mor 764a"],
    ["νῦν δ’ ἔγωγε ἤδη ἐντετύχηκα οὐχ οὕτως ἔχουσιν καὶ ἄλλοις, καὶ δὴ καὶ Σοφοκλεῖ ποτε τῷ ποιητῇ παρεγενόμην ἐρωτωμένῳ ὑπό τινος: ‘πῶς,’ ἔφη, ‘ὦ Σοφόκλεις, ἔχεις πρὸς τἀφροδίσια; ἔτι οἷός τε εἶ γυναικὶ συγγίγνεσθαι’; καὶ ὅς, ‘εὐφήμει,’ ἔφη, ‘ὦ ἄνθρωπε: ἁσμενέστατα μέντοι αὐτὸ ἀπέφυγον, ὥσπερ λυττῶντά τινα καὶ ἄγριον δεσπότην ἀποδράς.’", "ὁ γὰρ Σοφοκλῆς ἄσμενος ἔφη τὰ ἀφροδίσια γεγηρακὼς ἀποπεφευγέναι καθάπερ ἄγριον καὶ λυσσῶντα δεσπότην·", "Platon, Res Publica 329b6", "Plutarchus Phil. et Biogr., An seni respublica gerenda sit (783b–797f) 788e6"],
    ["ἀγαθὸς ἦν, ἀγαθῷ δὲ οὐδεὶς περὶ οὐδενὸς οὐδέποτε ἐγγίγνεται φθόνος: τούτου δ᾽ ἐκτὸς ὢν πάντα ὅτι μάλιστα ἐβουλήθη γενέσθαι παραπλήσια ἑαυτῷ.", "ἡ γάρ ‘ἀναστρέφουσα’ τὸν οὐρανόν, ὥσπερ ἐν Πολιτικῷ λέγεται, καὶ ἀνελίττουσα πρὸς τοὐναντίον ἀνάγκη καὶ ’σύμφυτος ἐπιθυμία’ καὶ ’τὸ τῆς πάλαι ποτὲ φύσεως σύντροφον πολλῆς μετέχον ἀταξίας, πρὶν εἰς τὸν νῦν κόσμον ἀφικέσθαι’, πόθεν ἐγγέγονε τοῖς πράγμασιν, εἰ τὸ μὲν ὑποκείμενον ἄποιος ἦν ὕλη καὶ ἄμοιρος αἰτίας ὁ δὲ δημιουργὸς ἀγαθὸς καὶ πάντα βουλόμενος αὑτῷ κατὰ δύναμιν ἐξομοιῶσαι τρίτον δὲ παρὰ ταῦτα μηδέν", "Plat. Tim. 29e", "Plut. Mor. 1015a-b"],
    ["διὰ παντὸς δὲ ἔλεγον αὐτῆς σωτηρίαν τὸ ἔν τε λύπαις ὄντα διασῴζεσθαι αὐτὴν καὶ ἐν  ἡδοναῖς καὶ ἐν ἐπιθυμίαις καὶ ἐν φόβοις καὶ μὴ ἐκβάλλειν.", "Ἡδοναὶ καὶ λῦπαι φόβοι τε καὶ θάρρη ἐπιθυμίαι τε καὶ ἀποστροπαὶ καὶ τὸ ἀλγεῖν τίνος ἄν εἶεν", "Plat. rep. 4, 429c-d", "Plot. Enn. I, 1, 1,1"],
    ["ἡ δ᾽ ἐκ μέσου πρὸς τὸν ἔσχατον οὐρανὸν πάντῃ διαπλακεῖσα κύκλῳ τε αὐτὸν ἔξωθεν περικαλύψασα, αὐτὴ ἐν αὑτῇ στρεφομένη, θείαν ἀρχὴν ἤρξατο ἀπαύστου καὶ ἔμφρονος βίου πρὸς τὸν σύμπαντα χρόνον.", "ἀλλὰ εἰ ἐμέμικτο, ἢ κρᾶσίς τις ἦν, ἢ ὡς διαπλακεῖσα, ἢ ὡς ἆδος οὐ κεχωρισμένον.", "Plat. Tim. 36e", "Plot. Enn. I, 1, 3,18"],
    ["τῆς ἀμερίστου καὶ ἀεὶ κατὰ ταὐτὰ ἐχούσης οὐσίας καὶ τῆς αὖ περὶ τὰ σώματα γιγνομένης μεριστῆς τρίτον ἐξ ἀμφοῖν ἐν μέσῳ συνεκεράσατο οὐσίας εἶδος, τῆς τε ταὐτοῦ φύσεως αὖ πέρι καὶ τῆς τοῦ ἑτέρου, καὶ κατὰ ταὐτὰ συνέστησεν ἐν μέσῳ τοῦ τε ἀμεροῦς αὐτῶν καὶ τοῦ κατὰ τὰ σώματα μεριστοῦ.", "Ἢ ὡς ἐποχούμενον τῇ νοητῇ φύσει καὶ τῇοὐσίᾳ τῇ ὄντως, ἡμᾶς δὲ ἐκεῖθεν τρίτους ἐκ τῆς ἀμερίστου, φησί, τῆς ἄνωθεν καὶ ἐκ τῆς περὶ τὰ σώματα μεριστῆς ἣν δὴ δεῖ νοεῖν οὕτω μεριστὴν περὶ τὰ σώματα, ὅτι δίδωσιν ἑαυτὴν τοῖς σώματος μεγέθεσιν, ὁπόσον ἂν ζῷον ᾖ ἕκαστον, ἐπεὶ καὶ τῷ παντὶ ὅλῳ, οὖσα μία·", "Plat. Tim. 35a", "Plot. Enn. I, 1, 8,9"],
    ["ὅστις ἄρα τῶν τοῦ σώματός τι γιγνώσκει, τὰ αὑτοῦ ἀλλ᾽ οὐχ αὑτὸν ἔγνωκεν.", "ἀλλ` ὃ ζητεῖ ὡς ἀναγκαῖον ζητεῖ, καὶ οὐχ ἃ αὑτῷ, ἀλλά τινι τῶν αὑτοῦ.", "Plat. Alk. 1 131a", "Plot. Enn. I, 4, 4, 25"],
    ["ἐπεὶ  ὅτι γε ἡ τοῦ ἀγαθοῦ ἰδέα μέγιστον μάθημα πολλάκις ἀκήκοας, ᾗ δὴ καὶ δίκαια καὶ τἆλλα προσχρησάμενα χρήσιμα καὶ ὠφέλιμα γίγνεται.", "τὸ δὲ μέγιστον μάθημα πρόχειρον ἀεὶ καὶ μετ’ αὐτοῦ καὶ τοῦτο μᾶλλον, κἂν ἐν τῷ Φαλάριδος ταύρῳ λεγομένῳ ᾖ, ὃ μάτην λέγεται ἡδὺ δὶς ἢ καὶ πολλάκις λεγόμενον.", "Plat. rep. 6, 505a", "Plot. Enn. I, 4, 13"],
    ["τοῦτο γὰρ δή ἐστι τὸ ὀρθῶς ἐπὶ τὰ ἐρωτικὰ ἰέναι ἢ ὑπ’ ἄλλου ἄγεσθαι, ἀρχόμενον ἀπὸ τῶνδε τῶν καλῶν ἐκείνου ἕνεκα τοῦ καλοῦ ἀεὶ ἐπανιέναι,  ὥσπερ ἐπαναβασμοῖς χρώμενον ἀπὸ ἑνὸς ἐπὶ δύο καὶ ἀπὸ δυοῖν ἐπὶ πάντα τὰ καλὰ σώματα, καὶ ἀπὸ τῶν καλῶν σωμάτων ἐπὶ τὰ καλὰ ἐπιτηδεύματα, καὶ ἀπὸ τῶν ἐπιτηδευμάτων ἐπὶ τὰ καλὰ μαθήματα, καὶ ἀπὸ τῶν μαθημάτων ἐπ’ ἐκεῖνο τὸ μάθημα τελευτῆσαι, ὅ ἐστιν οὐκ ἄλλου ἢ αὐτοῦ ἐκείνου τοῦ καλοῦ μάθημα, καὶ γνῷ αὐτὸ τελευτῶν ὃ ἔστι καλόν.", "Τοῦτο γὰρ εὑρόντες τάχ` ἂν ἐπιβάθρᾳ αὐτῷ χρώμενοι καὶ τὰ ἄλλα θεασαίμεθα.", "Plat. symp. 211c", "Plot. Enn. I, 6, 1,19"],
    ["Οὐκοῦν ἀνάγκη, ἔφη, ἐκ πάντων τούτων παρίστασθαι δόξαν τοιάνδε τινὰ τοῖς γνησίως φιλοσόφοις, ὥστε καὶ πρὸς ἀλλήλους τοιαῦτα ἄττα λέγειν, ὅτι “Κινδυνεύει τοι ὥσπερ ἀτραπός τις ἐκφέρειν ἡμᾶς [μετὰ τοῦ λόγου ἐν τῇ σκέψει], ὅτι,  ἕως ἂν τὸ σῶμα ἔχωμεν καὶ συμπεφυρμένη ᾖ ἡμῶν ἡ ψυχὴ μετὰ τοιούτου κακοῦ, οὐ μή ποτε κτησώμεθα ἱκανῶς οὗ ἐπιθυμοῦμεν·", "Αὐτὸ τοῦτο τὸ αἶσχος αὐτῇ ἆρα οὐ προσγεγονέναι οἷον ἐπακτὸν καλὸν φήσομεν, ὃ ἐλωβήσατο μὲν αὐτῇ, πεποίηκε δὲ αὐτὴν ἀκάθαρτον καὶ πολλῷ τῷ κακῷ συμπεφυρμένην οὐδὲ ζωὴν ἔτι ἔχουσαν οὐδὲ αἴσθησιν καθαράν, ἀλλὰ τῷ μίγματι τοῦ κακοῦ ἀμυδρᾷ τῇ ζωῇ κεχρημένην καὶ πολλῷ τῷ θανάτῳ κεκραμένην, οὐκέτι μὲν ὁρῶσαν ἃ δεῖ ψυχὴν ὁρᾶν, οὐκέτι δὲ ἐωμένην ἐν αὐτῇ μένειν τῷ ἕλκεσθαι ἀεὶ πρὸς τὸ ἔξω καὶ τὸ κάτω καὶ τὸ σκοτεινόν;", "Plat. Phaed. 66b", "Plot. Enn. I, 6, 5,31"],
    ["ἆρα μὴ ἄλλο τι ἢ τὴν τῆς ψυχῆς ἀπὸ τοῦ σώματος ἀπαλλαγήν; καὶ εἶναι τοῦτο τὸ τεθνάναι, χωρὶς μὲν ἀπὸ τῆς ψυχῆς ἀπαλλαγὲν αὐτὸ καθ’ αὑτὸ τὸ σῶμα γεγονέναι, χωρὶς δὲ τὴν ψυχὴν [ἀπὸ] τοῦ σώματος ἀπαλλαγεῖσαν αὐτὴν καθ’ αὑτὴν εἶναι; ἆρα μὴ ἄλλο τι ᾖ ὁ θάνατος ἢ τοῦτο", "ὁ δέ ἐστιν ὁ θάνατος χωρὶς εἶναι τὴν ψυχὴν τοῦ σώματος.", "Plat. Phaed. 64c", "Plot. Enn. I, 6, 6"],
    ["ὁ θάνατος τυγχάνει ὤν, ὡς ἐμοὶ δοκεῖ, οὐδὲν ἄλλο ἢ δυοῖν πραγμάτοιν διάλυσις, τῆς ψυχῆς καὶ τοῦ σώματος, ἀπ᾽ ἀλλήλοιν οὐ πολὺ ἧττον ἑκάτερον αὐτοῖν ἔχει τὴν ἕξιν τὴν αὑτοῦ ἥνπερ καὶ ὅτε ἔζη ὁ ἄνθρωπος, τό τε σῶμα τὴν φύσιν τὴν αὑτοῦ καὶ τὰ θεραπεύματα καὶ τὰ παθήματα ἔνδηλα πάντα.", "ἀλλ` εἰ σύνοδος μὲν ψυχῆς καὶ σώματος ζωή, θάνατος δὲ διάλυσις τούτων , ἡ ψυχὴ ἔσται ἀμφοτέρων δεκτική.", "Plat. Gorg. 524b", "Plot. Enn. I, 7, 3"],
    ["τὴν δὲ νυκτὸς πρὸς ἡμέραν συμμετρίαν καὶ τούτων πρός τε ταῦτα καὶ πρὸς ἄλληλα, πρὸς μῆνα καὶ μηνὸς πρὸς ἐνιαυτὸν καὶ τῶν ἄλλων ἄστρων οὐκ ἄτοπον, οἴει, ἡγήσεται τὸν νομίζοντα γίγνεσθαί τε ταῦτα ἀεὶ ὡσαύτως καὶ οὐδαμῇ οὐδὲν παραλλάττειν, σῶμά τε ἔχοντα καὶ ὁρώμενα, καὶ ζητεῖν παντὶ τρόπῳ τὴν ἀλήθειαν αὐτῶν λαβεῖν", "πῶς γὰρ ἄν, φησι, σώματα ἔχοντα καὶ ὁρώμενα τὸ ἀπαραλλάκτως ἕξει καὶ τὸ ὡσαύτως", "Plat. rep. 7, 530b", "Plot. Enn. II, 1, 2"],
    ["διὸ δὴ κατὰ ταὐτὰ ἐν τῷ αὐτῷ καὶ ἐν ἑαυτῷ περιαγαγὼν αὐτὸ ἐποίησε κύκλῳ κινεῖσθαι στρεφόμενον τὰς δὲ ἓξ ἁπάσας κινήσεις ἀφεῖλεν καὶ ἀπλανὲς ἀπηργάσατο ἐκείνων.", "διὰ τί κύκλῳ κινεῖται", "Plat. Tim. 34a", "Plot. Enn. II, 2, 1"],
    ["ἀρετὴ δὲ ἀδέσποτον ἣν τιμῶν καὶ ἀτιμάζων πλέον καὶ ἔλαττον αὐτῆς ἕκαστος ἕξει.", "καὶ γὰρ ὅμως ἐν τούτοις τοῖς κακοῖς διὰ τοῦ σώματος ἀπειλημμένοις ἀδέσποτον ἀρετὴν θεὸς ἔδωκεν.", "Plat. rep. 10, 617e", "Plot. Enn. II, 3, 9"],
    ["τί οὖν, ὦ Διοτίμα; δαίμων μέγας, ὦ Σώκρατες.", "θεὸς μὲν οὖν ἐκείνης συναριθμουμένης, τὸ δὲ λοιπὸν δαίμων, φησί, μέγας καὶ τὰ πάθη τὰ ἐν αὐτῷ δαιμόνια.", "Plat. symp. 202d-e", "Plot. Enn. II, 3, 9,45"],
    ["τελέα ὲν οὖν οὖσα καὶ ἐπτερωμένη μετεωροπορεῖ τε καὶ πάντα τὸν κόσμον διοικεῖ ἡ δὲ πτερορρυήσασα φέρεται ἕως ἂν  στερεοῦ τινος ἀντιλάβηται, οὗ κατοικισθεῖσα, σῶμα γήϊνον  λαβοῦσα, αὐτὸ αὑτὸ δοκοῦν κινεῖν διὰ τὴν ἐκείνης δύναμιν, ζῷον τὸ σύμπαν ἐκλήθη, ψυχὴ καὶ σῶμα παγέν, θνητόν τ’ ἔσχεν ἐπωνυμίαν·", "ψυχῆς δὴ τὸ πᾶν τόδε διοικούσης κατὰ λόγον, οἷα δὴ καὶ ἐφ’ ἑκάστου ζῴου ἡ ἐν αὐτῷ ἀρχή, ἀφ’ ἧς ἕκαστα τὰ τοῦ ζῴου μέρη καὶ πλάττεται καὶ πρὸς τὸ ὅλον συντέτακται, οὗ μέρη ἐστίν, ἐν μὲν τῷ ὅλῳ ἐστὶ τὰ πάντα, ἐν δὲ τοῖς μέρεσι τοσοῦτον μόνον, ὅσον ἐστὶν ἕκαστον.", "Plat. Phaedr. 246c", "Plot. Enn. II, 3, 13,3"],
    ["οὐ γὰρ ἂν ὀρθὸν ἔχοι λόγον θεοὺς ἀγνοεῖν τὰ πρέποντα ἑκάστοις αὑτῶν, οὐδ’ αὖ γιγνώσκοντας τὸ μᾶλλον ἄλλοις προσῆκον τοῦτο ἑτέρους αὑτοῖς δι’ ἐρίδων ἐπιχειρεῖν κτᾶσθαι—δίκης δὴ κλήροις τὸ φίλον λαγχάνοντες κατῴκιζον τὰς χώρας, καὶ κατοικίσαντες, οἷον νομῆς ποίμνια, κτήματα καὶ θρέμματα ἑαυτῶν ἡμᾶς ἔτρεφον, πλὴν οὐ σώμασι σώματα βιαζόμενοι, καθάπερ ποιμένες κτήνη πληγῇ νέμοντες ἀλλ’ ᾗ μάλιστα εὔστροφον ζῷον, ἐκ πρύμνης ἀπευθύνοντες, οἷον οἴακι πειθοῖ ψυχῆς ἐφαπτόμενοι κατὰ τὴν αὐτῶν διάνοιαν, οὕτως ἄγοντες τὸ θνητὸν πᾶν ἐκυβέρνων.", "τὰ δὲ ἔμψυχα, τὰ μὲν τὸ κινεῖσθαι ἀορίστως ἔχει, ὡς ὑφ’ ἅρμασιν ἵπποι πρὶν τὸν ἡνίοχον ἀφορίσαι αὐτοῖς τὸν δρόμον, ἅτε δὴ πληγῇ νεμόμενα", "Plat. Kritias 109c", "Plot. Enn. II, 3, 13,14"],
    ["ἀνάρμοστον δ᾽ ἐστὶ τὸ αἰσχρὸν παντὶ τῷ θείῳ, τὸ δὲ καλὸν ἁρμόττον.", "τὸ μὲν γὰρ αἰσχρὸν ἐναντίον καὶ τῇ φύσει καὶ τῷ θεῷ.", "Plat. symp. 206d", "Plot. Enn. III, 5, 1,19"],
    ["τίκτειν δὲ ἐν μὲν αἰσχρῷ οὐ δύναται, ἐν δὲ τῷ καλῷ.", "καὶ γὰρ οὗτοι τίκτειν βούλονται ἐν καλῷ· ἐπείπερ ἄτοπον βουλομένην τὴν φύσιν καλὰ ποιεῖν ἐν αἰσχρῷ.", "Plat. symp. 206c", "Plot. Enn. III 5, 1,28"],
    ["ὁ οὖν Πόρος μεθυσθεὶς τοῦ νέκταρος - οἶνος γὰρ οὔπω ἦν - εἰς τὸν τοῦ Διὸς κῆπον εἰσελθὼν βεβαρημένος ηὗδεν.", "Διὸ καὶ ἐν τῇ γενέσει τοῦ Ἔρωτος ὁ Πλάτων φησὶ τὸν Πόρον τὴν μέθην ἔχειν τοῦ νέκταρος οἴνου οὔπω ὄντος ὡς πρὸ τοῦ αἰσθητοῦ τοῦ Ἔρωτος γενομένου καὶ τῆς Πενίας μετεχούσης φύσεως νοητοῦ, ἀλλ’ οὐκ εἰδώλου νοητοῦ οὐδ’ ἐκεῖθεν ἐμφαντασθέντος, ἀλλ’ ἐκεῖ γενομένης καὶ συμμιχθείσης ὡς ἐξ εἴδους καὶ ἀοριστίας, ἣν 〈ἦν〉 ἔχουσα ἡ ψυχὴ πρὶν τυχεῖν τοῦ ἀγαθοῦ, μαντευομένη δέ τι εἶναι κατὰ ἀόριστον καὶ ἄπειρον φάντασμα, τὴν ὑπόστασιν τοῦ Ἔρωτος τεκούσης.", "Plat. symp. 203b", "Plot. Enn. III, 5, 7"],
    ["Ταῦτ’ εἶπε, καὶ πάλιν ἐπὶ τὸν πρότερον κρατῆρα, ἐν ᾧ τὴν τοῦ παντὸς ψυχὴν κεραννὺς ἔμισγεν, τὰ τῶν πρόσθεν ὑπόλοιπα κατεχεῖτο μίσγων τρόπον μέν τινα τὸν αὐτόν, ἀκήρατα δὲ οὐκέτι κατὰ ταὐτὰ ὡσαύτως, ἀλλὰ δεύτερα καὶ τρίτα", "τὸ γὰρ δευτέρας καὶ τρίτας τῷ ἐγγύθεν καὶ τῷ πορρώτερον ὑπονοητέον εἰρῆσθαι , ὥσπερ καὶ παρ’ ἡμῖν οὐχ ὁμοίως πάσαις ψυχαῖς ὑπάρχει τὸ πρὸς τὰ ἐκεῖ, ἀλλ’ οἱ μὲν ἑνοῖντο ἄν, οἱ δὲ βάλλοιεν ἂν ἐγγὺς ἐφιέμενοι, οἷς δὲ ἧττον ἂν ἔχοι τοῦτο, καθὸ ταῖς δυνάμεσιν οὐ ταῖς αὐταῖς ἐνεργοῦσιν, ἀλλ’ οἱ μὲν τῇ πρώτῃ, οἱ δὲ τῇ μετ’ ἐκείνην, οἱ δὲ τῇ τρίτῃ, ἁπάντων τὰς πάσας ἐχόντων.", "Plat. Tim. 41d", "Plot. Enn. IV, 3, 6"],
    ["ἐλεήσας δὲ ὁ Ζεὺς ἄλλην μηχανὴν πορίζεται, καὶ μετατίθησιν αὐτῶν τὰ αἰδοῖα εἰς τὸ πρόσθεν—τέως γὰρ καὶ ταῦτα ἐκτὸς εἶχον, καὶ ἐγέννων καὶ ἔτικτον οὐκ εἰς ἀλλήλους ἀλλ’ εἰς γῆν, ὥσπερ οἱ τέττιγες—μετέθηκέ τε οὖν οὕτω αὐτῶν εἰς τὸ πρόσθεν καὶ διὰ τούτων τὴν γένεσιν ἐν ἀλλήλοις ἐποίησεν, διὰ τοῦ ἄρρενος ἐν τῷ θήλει, τῶνδε ἕνεκα, ἵνα ἐν τῇ συμπλοκῇ ἅμα μὲν εἰ ἀνὴρ γυναικὶ ἐντύχοι, γεννῷεν καὶ γίγνοιτο τὸ γένος, ἅμα δ’ εἰ καὶ ἄρρην ἄρρενι, πλησμονὴ γοῦν γίγνοιτο τῆς συνουσίας καὶ διαπαύοιντο καὶ ἐπὶ τὰ ἔργα τρέποιντο καὶ τοῦ ἄλλου βίου ἐπιμελοῖντο.", "Ζεὺς δὲ πατήρ ἐλεήσας πονουμένας θνητὰ αὐτῶν τὰ δεσμὰ ποιῶν περὶ ἃ πονοῦνται, δίδωσιν ἀναπαύλας ἐν χρόνοις ποιῶν σωμάτων ἐλευθέρας, ἵν’ ἔχοιεν ἐκεῖ καὶ αὗται γίνεσθαι, οὗπερ ἡ τοῦ παντὸς ψυχὴ ἀεὶ οὐδὲν τὰ τῇδε ἐπιστρεφομένη.", "Plat. symp. 191b", "Plot. Enn. IV, 3, 12,8"],
    ["Καὶ οὕτως, ὦ Γλαύκων, μῦθος ἐσώθη καὶ οὐκ ἀπώλετο,  καὶ ἡμᾶς ἂν σώσειεν, ἂν πειθώμεθα αὐτῷ, καὶ τὸν τῆς Λήθης ποταμὸν εὖ διαβησόμεθα καὶ τὴν ψυχὴν οὐ μιανθησόμεθα.", "διὸ καὶ ὁ τῆς Λήθης ποταμὸς οὗτος ἂν ὑπονοοῖτο.", "Plat. rep. 10, 621c", "Plot. Enn. IV, 3, 26,54"],
    ["καὶ μὴν καὶ ὅταν ἀπολέσασα μνήμην εἴτ᾽ αἰσθήσεως εἴτ᾽ αὖ μαθήματος αὖθις ταύτην ἀναπολήσῃ πάλιν αὐτὴ ἐν ἑαυτῇ, καὶ ταῦτα σύμπαντα ἀναμνήσεις καὶ μνήμας που λέγομεν.", "σώματος γὰρ καθαρωτέρα γενομένη καὶ ἃ ἐνταῦθα οὐκ εἶχεν ἐν μνήμῃ ἀναπολήσει.", "Plat. Phil. 34b-c", "Plot. Enn. IV, 3, 27"],
    ["οὐκοῦν ἐν μὲν τῇ τοῦ Διὸς ἐρεῖς φύσει βασιλικὴν μὲν ψυχήν, βασιλικὸν δὲ νοῦν ἐγγίγνεσθαι διὰ τὴν τῆς αἰτίας δύναμιν, ἐν δ᾽ ἄλλοις ἄλλα καλά, καθ᾽ ὅτι φίλον ἑκάστοις λέγεσθαι.", "ὁ δὲ δὴ πάντα κοσμῶν Ζεὺς καὶ ἐπιτροπεύων καὶ διατιθεὶς εἰσαεί, ψυχὴν βασιλικὴν καὶ βασιλικὸν vοῦν ἔχων.", "Plat. Phil. 30d", "Plot. Enn. IV, 4, 9"],
    ["ὀμμάτων τε γὰρ ἐπεδεῖτο οὐδέν, ὁρατὸν γὰρ οὐδὲν ὑπελείπετο ἔξωθεν, οὐδ᾽ ἀκοῆς, οὐδὲ γὰρ ἀκουστόν.", "ἀλλ´ ὀμμάτων, φησίν, οὐκ ἐπεδεῖτο.", "Plat. Tim. 33c", "Plot. Enn. IV, 4, 24"],
    ["ψυχὴ πᾶσα παντὸς ἐπιμελεῖται τοῦ ἀψύχου, πάντα δὲ οὐρανὸν περιπολεῖ, ἄλλοτ’ ἐν ἄλλοις εἴδεσι γιγνομένη. τελέα μὲν οὖν οὖσα καὶ ἐπτερωμένη μετεωροπορεῖ τε καὶ πάντα τὸν κόσμον διοικεῖ, ἡ δὲ πτερορρυήσασα φέρεται ἕως ἂν στερεοῦ τινος ἀντιλάβηται, οὗ κατοικισθεῖσα, σῶμα γήϊνον λαβοῦσα, αὐτὸ αὑτὸ δοκοῦν κινεῖν διὰ τὴν ἐκείνης δύναμιν,ζῷον τὸ σύμπαν ἐκλήθη, ψυχὴ καὶ σῶμα παγέν, θνητόν τ’   ἔσχεν ἐπωνυμίαν·", "Νοῦς τοίνυν ἡγεμὼν καὶ βασιλεὺς τῶν ὄντων τέχνη τε δημιουργικὴ τοῦ παντὸς τοῖς μὲν θεοῖς ὡσαύτως ἀεὶ πάρεστι τελέως καὶ αὐταρκῶς καὶ ἀνενδεῶς, κατὰ μίαν ἐνέργειαν ἑστῶσαν ἐν ἑαυτῇ καθαρῶς, ἡ δὲ ψυχὴ νοῦ τε μετέχει μεριστοῦ καὶ πολυειδοῦς εἰς τὴν τοῦ ὅλου τε προστασίαν ἀναποβλέποντος, καὶ αὐτὴτῶν ἀψύχων ἐπιμελεῖται ἄλλοτε ἐν ἄλλοις εἴδεσιν ἐγγιγνομένη.", "PLATO, Phaedrus, 246b-c", "IAMBLICHUS, De mysteriis 1.7"],
    ["Παντάπασι δή, ἦν δ’ ἐγώ, οἱ τοιοῦτοι οὐκ ἂν ἄλλο τι νομίζοιεν τὸ ἀληθὲς ἢ τὰς τῶν σκευαστῶν σκιάς. Πολλὴ ἀνάγκη, ἔφη. Σκόπει δή, ἦν δ’ ἐγώ, αὐτῶν λύσιν τε καὶ ἴασιν τῶν τε δεσμῶν καὶ τῆς ἀφροσύνης, οἵα τις ἂν εἴη, εἰ φύσει τοιάδε συμβαίνοι αὐτοῖς·", "Θεραπείας οὖν ἕνεκα τῆς ἐν ἡμῖν ψυχῆς καὶ μετριότητος τῶν διὰ τὴν γένεσιν προσφυομένων αὐτῇ κακῶν, λύσεώς τε ἀπὸ τῶν δεσμῶν καὶ ἀπαλλαγῆς χάριν τὰ τοιαῦτα προσάγεται.", "PLATO, Respublica, 515c", "IAMBLICHUS Phil. De mysteriis 1.11"],
    ["Τὸν δὲ ὑπερουράνιον τόπον οὔτε τις ὕμνησέ πω τῶν τῇδε ποιητὴς οὔτε ποτὲ ὑμνήσει κατ’ ἀξίαν. ἔχει δὲ ὧδε—τολμητέον γὰρ οὖν τό γε ἀληθὲς εἰπεῖν, ἄλλως τε καὶ περὶ ἀληθείας λέγοντα—ἡ γὰρ ἀχρώματός τε καὶ ἀσχημάτιστος καὶ ἀναφὴς οὐσία ὄντως οὖσα, ψυχῆς κυβερνήτῃ μόνῳ θεατὴ νῷ, περὶ ἣν τὸ τῆς ἀληθοῦς ἐπιστήμης γένος, τοῦτον ἔχει τὸν τόπον.", "Ἄτοποι οὖν οἵ τε χρῶμα καὶ σχῆμα καὶ ἁφὴν τοῖς νοητοῖς εἴδεσι προστιθέντες, διότι τὰ μεταλαμβάνοντα αὐτῶν εἰσι τοιαῦτα, καὶ οἱ τοῖς οὐρανίοις σώμασι κακίαν ἀνατιθέντες, διότι τὰ μετέχοντα αὐτῶν φύεται ἐνίοτε κακά.", "PLATO, Phaedrus, 247c-d", "IAMBLICHUS, De mysteriis 1.18"],
    ["Ἀλλὰ μὴν τό γε περιέχον πέρας ἂν εἴη. — Πῶς δ’ οὔ; — Τὸ ἓν ἄρα ὂν ἕν τέ ἐστί που καὶ πολλά, καὶ ὅλον καὶ μόρια, καὶ πεπερασμένον καὶ ἄπειρον πλήθει. —Φαίνεται. — Ἆρ’ οὖν οὐκ, ἐπείπερ πεπερασμένον, καὶ ἔσχατα ἔχον; — Ἀνάγκη. — Τί δέ; εἰ ὅλον, οὐ καὶ ἀρχὴν ἂν ἔχοι καὶ μέσον καὶ τελευτήν; ἢ οἷόν τέ τι ὅλον εἶναι ἄνευ τριῶν τούτων; κἄν του ἓν ὁτιοῦν αὐτῶν ἀποστατῇ, ἐθελήσει ἔτι ὅλον εἶναι; — Οὐκ ἐθελήσει. ", "Ἐπὶ δέ γε τῶν θεῶν ἐν τῇ ἑνώσει πάντων ἐστὶν ἡ τάξις, τά τε πρῶτα καὶ δεύτερα αὐτῶν γένη καὶ τὰ περὶ αὐτὰ φυόμενα πολλὰ ἐν ἑνὶ τὰ ὅλα συνυφέστηκε, τό τε πᾶν ἐν αὐτοῖς ἐστι τὸ ἕν, ἀρχή τε καὶ μέσα καὶ τέλη κατ’ αὐτὸ τὸ ἓν συνυπάρχει· ὥστ’ ἐπί γε τούτων οὐδὲ χρὴ ζητεῖν πόθεν τὸ ἓν ἅπασιν ἐφήκει.", "PLATO, Parmenides,  145a", "IAMBLICHUS, De mysteriis 1.19"],
    ["ΣΩ. Συλλόγισαι δὴ κοινῇ μετ’ ἐμοῦ τί ἡμῖν συμβαίνει    ἐκ τῶν ὡμολογημένων· καὶ δὶς γάρ τοι καὶ τρίς φασιν καλὸν εἶναι τὰ καλὰ λέγειν τε καὶ ἐπισκοπεῖσθαι.", "Ἀλλ’ ἐπεὶ δεῖ τὰ καλά, ὥς φασι, πολλάκις λέγειν τε καὶ ἐπισκοπεῖν, οὐδ’ ἡμεῖς ὑπερβησόμεθα ταῦτα ὡς ἤδη τετυχηκότες ἱκανῆς ἀποκρίσεως·", "PLATO, Gorgias, 498e-499a", "IAMBLICHUS, De mysteriis 1.20"],
    ["Τί τοῦτο, ὦ Σώκρατες; ἔφη ὁ Κέβης. Ὅτι ψυχὴ παντὸς ἀνθρώπου ἀναγκάζεται ἅμα τε ἡσθῆναι σφόδρα ἢ λυπηθῆναι ἐπί τῳ καὶ ἡγεῖσθαι περὶ ὃ ἂν μάλιστα τοῦτο πάσχῃ, τοῦτο ἐναργέστατόν τε εἶναι καὶ ἀληθέστατον, οὐχ οὕτως ἔχον· ταῦτα δὲ μάλιστα <τὰ> ὁρατά· ἢ οὔ; Πάνυ γε. Οὐκοῦν ἐν τούτῳ τῷ πάθει μάλιστα καταδεῖται ψυχὴ ὑπὸ σώματος; Πῶς δή; Ὅτι ἑκάστη ἡδονὴ καὶ λύπη ὥσπερ ἧλον ἔχουσα προσηλοῖ αὐτὴν πρὸς τὸ σῶμα καὶ προσπερονᾷ καὶ ποιεῖ σωματοειδῆ, δοξάζουσαν ταῦτα ἀληθῆ εἶναι ἅπερ ἂν καὶ τὸ σῶμα φῇ. ", "ἀλλὰ μὴν ἥ γε τῶν ψυχῶν θέα τῶν μὲν ἀχράντων καὶ    ἐν ἀγγέλων τάξει ἱδρυμένων ἀναγωγός ἐστι καὶ ψυχῆς σωτήριος, ἐπ’ ἐλπίδι τε ἱερᾷ ἐκφαίνεται, καὶ ὧν ἡ ἐλπὶς ἡ ἱερὰ ἀντιποιεῖται ἀγαθῶν τούτων παρέχει τὴν δόσιν· ἡ δὲ τῶν ἑτέρων καταγωγὸς ἐπὶ τὴν γένεσιν ὑπάρχει, φθείρει τε τοὺς τῆς ἐλπίδος καρποὺς καὶ παθῶν πληροῖ προσηλούντων τοὺς θεωροῦντας τοῖς σώμασιν. ", "PLATO, Phaedo,  83b-d", "IAMBLICHUS, De mysteriis 2.6"],
    ["Τί δέ; μαχαίρᾳ ἂν ἀμπέλου κλῆμα ἀποτέμοις καὶ σμίλῃ καὶ ἄλλοις πολλοῖς; Πῶς γὰρ οὔ; Ἀλλ’ οὐδενί γ’ ἂν οἶμαι οὕτω καλῶς ὡς δρεπάνῳ τῷ ἐπὶ τούτῳ ἐργασθέντι. Ἀληθῆ. Ἆρ’ οὖν οὐ τοῦτο τούτου ἔργον θήσομεν; Θήσομεν μὲν οὖν. Νῦν δὴ οἶμαι ἄμεινον ἂν μάθοις ὃ ἄρτι ἠρώτων, πυνθανόμενος εἰ οὐ τοῦτο ἑκάστου εἴη ἔργον ὃ ἂν ἢ μόνον τι ἢ  κάλλιστα τῶν ἄλλων ἀπεργάζηται. Ἀλλά, ἔφη, μανθάνω τε καί μοι δοκεῖ τοῦτο ἑκάστου  πράγματος ἔργον εἶναι. ", "Ὥσπερ οὖν μαχαίρας ἔργον ἐστὶ τὸ τέμνειν καὶ οὐδὲν ἄλλο ποιεῖ ἢ τοῦτο, οὕτω καὶ τῶν ἐν τῷ παντὶ διῃρημένων πνευμάτων κατὰ φύσεως μεριστὴν ἀνάγκην τὸ μὲν διαιρεῖ, ἄλλο δὲ συνάγει τὰ γιγνόμενα.", "PLATO, Respublica, 353a", "IAMBLICHUS, De mysteriis 4.1"]
]; //nächster Eintrag: 103

//regexp for lautverschiebung, buchstaben ersetzung
//hier lautet die Annahmen, das alle buchstaben so ersetzt werden müssen, nicht permutieren
let fromKl1 = new RegExp('<', 'g');
let fromKl2 = new RegExp('>', 'g');
let fromDOT = new RegExp('.', 'g');
let fromKOMMA = new RegExp(';', 'g');
let fromNEWL = new RegExp('\n', 'g');
let fromBR = new RegExp('<br>', 'g');
let fromBR2 = new RegExp('<br/>', 'g');
let stopthiswordsL1 = {"du": "", "de": "", "tlg":"", "phi":"", "et":"", "al":"", "biogr":"", "phil":"" };
let fromi1 = new RegExp('i', 'g');
let toy1 = "y";
let fromI1 = new RegExp('I', 'g');
let toY1 = "Y";
let frome2 = new RegExp('e', 'g');
let toeu2 = "ev";
let fromE2 = new RegExp('E', 'g');
let toEU2 = "EV";
let toi3 = "i";
let toI3 = "I";
let fromo4 = new RegExp('o', 'g');
let tou4 = "v";//u
let fromO4 = new RegExp('O', 'g');
let toU4 = "V";//U
let fromu5 = new RegExp('v', 'g'); //because of delall with latinUV v and V is u and U
let too5 = "o";
let fromU5 = new RegExp('V', 'g');
let toO5 = "O";
let fromoi6 = new RegExp('oi', 'g');
let fromOI6 = new RegExp('OI', 'g');
let fromei7 = new RegExp('ei', 'g');
let fromEI7 = new RegExp('EI', 'g');
let fromai8 = new RegExp('ai', 'g');
let toe8 = "e";
let fromAI8 = new RegExp('AI', 'g');
let toE8 = "E";
let toae9 = "ae";
let toAE9 = "AE";
let fromc9 = new RegExp('c', 'g');
let fromC9 = new RegExp('C', 'g');
let tok10 = "k";
let toK10 = "K";


/*------------------------------------------------------------------------------
                             DATA GETTING 
------------------------------------------------------------------------------*/

//get html data from server proxy AND local DATA
function loadtdthree(){
    let xmlHttp = new XMLHttpRequest( );
    xmlHttp.onreadystatechange = function( ){ 
        if( xmlHttp.readyState == 4 && xmlHttp.status == 200 ){
            /*let resuARRAY = GENCTSURN3( xmlHttp.responseText );
            document.getElementById( "awebdisp" ).innerHTML = resuARRAY[ 1 ];
            document.getElementById( "alistdisp" ).innerHTML = "<span class='listemeu' onclick='linesmark()'>Lines</span><span class='listemeu' onclick='listtocsv()'>CSV</span><span class='listemeu' onclick='h2shwing()'>H2</span><span class='listemeu' onclick='h1shwing()'>H1</span> <span class='listemeu' onclick='h0shwing()'>H0</span>"+resuARRAY[ 0 ];
            */
            let resuARRAY = GENCTSURN2( xmlHttp.responseText );
            console.log(resuARRAY);
                document.getElementById( "awebdisp" ).innerHTML = xmlHttp.responseText;
                document.getElementById( "alistdisp" ).innerHTML = "<span class='listemeu' onclick='linesmark()'>Lines</span><span class='listemeu' onclick='listtocsv()'>CSV</span><span class='listemeu' onclick='h2shwing()'>H2</span><span class='listemeu' onclick='h1shwing()'>H1</span> <span class='listemeu' onclick='h0shwing()'>H0</span>"+resuARRAY;
        }
    }
    //xmlHttp.open( "GET", "pages/tlrr.tml", true );
    //xmlHttp.open( "GET", "pages/tlrrM.tml", true );
    xmlHttp.open( "GET", "pages/testdata3.tml", true ); // true for asynchronous 
    //xmlHttp.open( "GET", "pages/testdata4.tml", true );
    xmlHttp.send( null ); 
}

function getsitefromurlinp( ){
    let xmlHttp = new XMLHttpRequest( );
    xmlHttp.onreadystatechange = function( ){ 
        if( xmlHttp.readyState == 4 && xmlHttp.status == 200 ){
            if( xmlHttp.responseText.indexOf( 'id="tab_text_ocr"' ) != -1 ){
                let theinp1 = xmlHttp.responseText.split( 'id="tab_text_ocr"' );
                
                let theinp2 = theinp1[1].split( "tab-pane" );
                let resuARRAY = GENCTSURN( theinp2[0] );
                theinp2[0] = "";
                document.getElementById( "awebdisp" ).innerHTML = theinp1[0]+resuARRAY[ 1 ]+theinp2.join("tab-pane");
                document.getElementById( "alistdisp" ).innerHTML = "<span class='listemeu' onclick='linesmark()'>Lines</span><span class='listemeu' onclick='listtocsv()'>CSV</span><span class='listemeu' onclick='h2shwing()'>H2</span><span class='listemeu' onclick='h1shwing()'>H1</span> <span class='listemeu' onclick='h0shwing()'>H0</span>"+resuARRAY[ 0 ];
            } else if( xmlHttp.responseText.indexOf('class="trial"') != -1 ){
                let theinp1 = xmlHttp.responseText.split( 'class="trial"' );
                let resuARRAY = GENCTSURN( theinp1[1] );
                let first = theinp1[0].split('<div class="trials">');
                theinp1[0] = "";
                document.getElementById( "awebdisp" ).innerHTML = '<div class="trials">'+first[1]+resuARRAY[ 1 ]+theinp1.join('class="trial"');
                document.getElementById( "alistdisp" ).innerHTML = "<span class='listemeu' onclick='linesmark()'>Lines</span><span class='listemeu' onclick='listtocsv()'>CSV</span><span class='listemeu' onclick='h2shwing()'>H2</span><span class='listemeu' onclick='h1shwing()'>H1</span> <span class='listemeu' onclick='h0shwing()'>H0</span>"+resuARRAY[ 0 ];
            } else {
                let resuARRAY = GENCTSURN( xmlHttp.responseText );
                document.getElementById( "awebdisp" ).innerHTML = resuARRAY[ 1 ];
                document.getElementById( "alistdisp" ).innerHTML = "<span class='listemeu' onclick='linesmark()'>Lines</span><span class='listemeu' onclick='listtocsv()'>CSV</span><span class='listemeu' onclick='h2shwing()'>H2</span><span class='listemeu' onclick='h1shwing()'>H1</span> <span class='listemeu' onclick='h0shwing()'>H0</span>"+resuARRAY[ 0 ];
            }
 
            
            //for( let qu = 0; qu < resuARRAY[1].length; qu++ ){
                //prepare the display of verbindungen
                //resuARRAY[3]
                //document.getElementById( "alistdisp" ).pushChild( );
            //}
        }
    }
    if(document.getElementById( "inpurl" ).value == ""){
        document.getElementById( "inpurl" ).value = "http://localhost/pages/testdata4.tml";
    }
    xmlHttp.open( "GET", "scri/prox.php?url=" + document.getElementById( "inpurl" ).value, true ); // true for asynchronous 
    xmlHttp.send( null ); 

    //savekeyandlanglist();
}



/*------------------------------------------------------------------------------
                     Programming Python AND JS helper
------------------------------------------------------------------------------*/

function len( aA ){
    if( aA ){
        if( aA instanceof Set ){
            return aA.size;
        } else {
            return aA.length;
        }
    } else {
        return 0;
    }
}

function set( aA ){
    return new Set( aA );
}

function list( aS ){
    return Array.from( aS );
}

function print(  ){//call with arbitrary arguments and print the argumnet array
    //for( let a in arguments ){
        console.log( arguments );
    //}
}

function max( a, b ){
    return Math.max(a, b);
}

function min(a, b){
    return Math.min(a, b);
}




/*------------------------------------------------------------------------------
            SET OPERATIONS (TO BE DEFINED IN PYtHON ALSO)
------------------------------------------------------------------------------*/


function SetSymDiff( setA, setB ){ //Python:^, In A und nicht in B in B und nicht in A
    let AB = [...setA].filter(x => !setB.has( x ));
    let BA = [...setB].filter(x => !setA.has( x ));
    /*console.log(BA instanceof Array, AB instanceof Array);
    for( let item of AB ){
        BA.add( item );
    }*/
    let symDiff = new Set( AB.concat( BA ) );
    return symDiff;
}

function SetDiff( setA, setB ){ //in A und nicht in B
    return [...setA].filter(x => !setB.has( x ));
}

function SetUnsion( setA, setB ){//Python: |
    let union = new Set( [...setA, ...setB] );
    return union;
}

function SetIntersection( setA, setB ){//Python: &
    return [...setA].filter( x => setB.has( x ));
}




/**

09/2019 CTS URN EXT / GEN
 
RESTART WITH MUCH FATSER APROACHE

- 1 Stringdist 
- 2 dictonary 

ONLY

*/ 

//slow last stage of REF EXTRACT and CTS GEN
function H0H1H2deep( ws, hyporange ){
    //first rebuild potential range
    //Form: wwwwwzzz (zweifach ist muss)
    //Bedeutung wa ww z (dreifach muss herausgefunden werden)
    let returndeephyp = {};
     for( let hy = 0; hy < hyporange.length; hy += 1 ){
        //console.log( hyporange );
        let is = hyporange[ hy ][ 0 ];
        let machzwei = true;
        let nza = true;
        let p1 = [];

        let p2 = [];
        while( machzwei ){
            if( is === ws.length ){
                machzwei = false;
            } else {
                let wo = ws[ is ].replace(".","").replace(",","");
                if( wo !== "" ){
                    if( isNaN( parseInt( wo ) ) && nza ){
                        p1.push( wo );  
                    } else if( !isNaN( parseInt( wo ) ) ){
                        p2.push( ws[ is ] );
                        nza = false;
                    } else {
                        machzwei = false;
                    }
                }
                is+=1; 
            }
        } 
        
        let maxinc = 0;
        let allmaxes = {};
        let maxvalues = [];
        for( let h in hyporange[ hy ][ 1 ] ){
            //
            let hypoautwerk = hyporange[ hy ][ 1 ][ h ][0] +" "+hyporange[ hy ][ 1 ][ h ][1];
            let countfac = 0;
            //console.log( hypoautwerk ); 
            for( let p in p1 ){
                countfac += containednessLCF( p1[p], hypoautwerk.toLowerCase() );
            }
            if(countfac <= 0.5){
                continue;
            }
            //countfac /= p1.length;
            //console.log(countfac, p1.length);
            if( allmaxes[ countfac ] ){
                allmaxes[ countfac ].push( hyporange[ hy ][1][h] );
            } else {
                allmaxes[ countfac ] = [ hyporange[ hy ][1][h] ];
                maxvalues.push(countfac);
            }
            if( maxinc < countfac ){
                maxinc = countfac;
                
            }
        }
        //console.log(allmaxes);
        maxvalues.sort( (a, b) => b - a );
        let howfar = 2;
        if(maxvalues.length < 2){
            howfar = maxvalues.length;
        }
        
        for(let m = 0; m < howfar; m+=1){
            // ich könnte nun die eine Auswahl wörtlich uaf den String beziehen und dann die andere, sowerf es gibt
            // wenn ich zwischend en Zweien ein wirklich passendes ausmachen kann, dann könnte ich das nehmen
            // ansonsten beide Vorschläge.
            // und eine Ablehungsklasse brauche ich noch
            
            for( let k in allmaxes[ maxvalues[ m ] ] ){
                let countAinB = 0;
                let countBinA = 0;
                let stristra = allmaxes[ maxvalues[ m ] ][k][0].replace(".","").toLowerCase( )+" "+allmaxes[ maxvalues[ m ] ][k][1].replace(".","").toLowerCase( );
                //console.log("jjj", stristra);
                for( let r in p1 ){
                    if( stristra.indexOf( p1[r] ) !== -1 ){
                        countAinB += 1;
                    }
                }
                countAinB /= p1.length;
                
                let wiwiawords = stristra.split( " " );
                stristra = p1.join( " " );
                //console.log("hhh", stristra);
                for( let r in wiwiawords ){
                    if( stristra.indexOf( wiwiawords[r] ) !== -1 ){
                        countBinA += 1;
                    }
                }
                countBinA /= wiwiawords.length;

                if( countAinB > 0.5 ||
                    countBinA > 0.5 ){
                    console.log("- P1: ", p1.join(" "), " - P2: ", p2.join(";") );
                    console.log(m, "TAKEN with ",maxvalues[m]," > ", allmaxes[maxvalues[m]][k][0]+" "+allmaxes[maxvalues[m]][k][1]+" "+p2.join(" ")+"("+allmaxes[maxvalues[m]][k][2]+")", countAinB, countBinA);
                    if( returndeephyp[ is ] ){
                        returndeephyp[is].push( [maxvalues[m], allmaxes[maxvalues[m]][k][0], allmaxes[maxvalues[m]][k][1], p2, stristra] );
                    } else {
                        returndeephyp[is] = [[maxvalues[m], allmaxes[maxvalues[m]][k][0], allmaxes[maxvalues[m]][k][1], p2, stristra]];
                    }
                } else {

                }
            }
        }
     }

    //reject overlaping hypothesis??? but how
    return returndeephyp;
}

/* H0H1H2 - fast veryfie the hypothesis AND compleat with h2*/
function H0H1H2ranges( ws, hypothesen ){
    //console.log("--hypothesen: ", hypothesen);
    let abr = len( hypothesen[1] );
    let indexstart = hypothesen[0];
    let rangeto = 10; //range size what?
    let indexend = indexstart + rangeto;
    let counth0 = 0;
    let counth1 = 0;
    let counth2 = 0;
    let rettext = "";
    let awnARRAY = [];
    for( let i = 0; i < abr; i++ ){
        
        let Au = hypothesen[1][i][0];
        
        let AuTri = ngram( Au, 3, True );
        let Aul = abkAW[Au][0];
        
        if(Aul == ""){
            Aul = Au;
        }
        let AulTri = ngram( Aul, 3, True );
        //console.log("----Hypo: ", Au, Aul);
        let goon = true;
        let j = indexstart;
        let woerterZuAu = [];
        
        
        while( goon ){
            if( j < indexend ){
                if( ws[ j ] != "" && ws[ j ] ){
                    let wo = ws[j].replace(".","");
                    /*
                    //hier fehlen jetzt die ganzen anpassungen, wiegroß, ohne punkte, die normaliesierungstufen - das ginge aber
                    //satzzeichen
                    if( Au.indexOf( ws[j] ) != -1 ){
                        woerterZuAu.push(1);
                    } else {
                        if( Aul.indexOf( ws[j] ) != -1  ){
                            woerterZuAu.push(1);
                        } else {
                            woerterZuAu.push(0);
                        }
                    }*/
                    //vielleicht versuchen wir es mit einer harten grenze und einem Maß
                    let WoTri = ngram( wo, 3, True );
                    let WoTriB = ngram( ws[j].toUpperCase(), 3, True );
                    let d1 = baire( AuTri, WoTriB );//jaccardMASZ( AuTri, WoTriB ); //generalized cantor metric more pricise
                    let d2 = baire( AulTri, WoTri );//jaccardMASZ( AulTri, WoTri );
                    let Auclean = Au.toLowerCase().replace(".","");
                    //let longestsubseq = LCS( Auclean, wo ); //bagdist - longest
                    //let longestsubseq = bagdist( Auclean, wo );
                    //let l1 = longestsubseq/len(Auclean); //kind of contained ness like i liked to define it
                    //let l2 = longestsubseq/len(wo);
                    let l3 = containednessLCS( Auclean, wo );
                    //console.log(wo, min(d1,  d2), l3);
                    //console.log(d1 < 0.5, d2 < 0.5, 0.5 < l1,   0.5 < l2)
                    //if( d1 < 0.5 || d2 < 0.5 ||  0.5 < l1 ||   0.5 < l2  ){
                    if( min(d1,d2) < 0.25  ||  0.5 < l3 ){
                    //if( d1 < 0.3 || d2 < 0.3 ||  0.4 < l1 ||   0.4 < l2  ){
                        woerterZuAu.push(1);
                    } else {
                        woerterZuAu.push(0);
                    }
                } else {
                    woerterZuAu.push(0);
                }
                j += 1;
            } else {
                goon = false;
            }
        }
        //console.log("Autor check", Au, Aul, woerterZuAu, "...", ws.slice(indexstart, indexend) );
        //raussuchen aus der 01 serie erstes 1, wenn nicht clean Hypothese
        let firsteinser = true;
        let texttahtisautor = [];
        let indexJzwei = 0;
        for( let e = 0; e < rangeto; e+=1 ){
            if( woerterZuAu[ e ] === 1 && firsteinser ){
                texttahtisautor.push( ws[indexstart+e] );
            } else {
                if( texttahtisautor.length !== 0 && firsteinser ){
                    indexJzwei = e;
                    firsteinser = false;
                }
            }
        }
        
        if( texttahtisautor.length !== 0 ){ //reject empty - hypothesis fals under the sight of other measures
            // j2 erzeugen, nach der h0
            if( indexJzwei === 0 ){ //letzte Position autor 1
                indexJzwei = rangeto;
            }
            indexJzwei += indexstart; 
            counth0+=1;
            //console.log("------ AUTOR: ", Aul, texttahtisautor, woerterZuAu, indexstart, indexJzwei, "...", ws.slice(indexstart, indexend) );
            // von j2 aus ws durchsuchen nach wörtern die bedingt in werken auftauchen
            
            let We = hypothesen[1][i][1];
            let Welen = len( We );
            for( let w = 0; w < Welen; w+=1 ){
                let Wek = We[w];
                let WekTri = ngram( Wek.toLowerCase(), 3, True );
                let Wel = abkAW[Au][1][Wek];
                let WelTri = ngram( Wel.toLowerCase(), 3, True );
                
                let woerterZuWe = [];
                goon = true;
                j = indexJzwei;
                
                while( goon ){
                    if( j < indexend ){
                        if(ws[j]){
                            let wo = ws[j].replace(".","").replace(",","");
                            if( wo != "" && isNaN(parseInt(wo))){
                                //check if words are part of a given Work
                                
                                let WoTri = ngram( wo, 3, True );
                                let d1 = baire(WekTri, WoTri);//jaccardMASZ( WekTri, WoTri );
                                let d2 = baire(WelTri, WoTri);//jaccardMASZ( WelTri, WoTri );
                                //let longestsubseq = LCS( Wek, wo ); //LSF????
                                //let l1 = longestsubseq/len(Wek); //kind of contained ness like i liked to define it
                                //let l2 = longestsubseq/len(wo); // ist das schon im Ergebnis von Jaccard enthalten, oder geibt es fälle  die unterschiedlich sind
                                let l3 = containednessLCS( Wek, wo );
                                //let l3 = containednessLCF( Wek, wo );
                                //console.log( wo, "--", Wel, d1, d2, l3);
                                //console.log(d1 < 0.5, d2 < 0.5 ,  0.5 < l1 ,  0.5 < l2)
                                //if( d1 < 0.5 || d2 < 0.5 ||  0.5 < l1 ||  0.5 < l2  ){
                                if( min(d1,d2) < 0.25 ||  0.3 < l3 ){                                
                                    woerterZuWe.push(1);
                                } else {
                                    woerterZuWe.push(0);
                                }
                            } else {
                                woerterZuWe.push(0);
                            }
                        }
                        
                        j+=1;
                    } else {
                        goon = false;
                    }
                }

                firsteinser = true;
                let texttahtiswork = [];
                let indexWzwei = 0;
                for( let e = 0; e < woerterZuWe.length; e+=1 ){
                    if( woerterZuWe[ e ] === 1 && firsteinser ){
                        texttahtiswork.push( ws[indexJzwei+e] );
                    } else {
                        if( texttahtiswork.length !== 0 && firsteinser ){
                            indexWzwei = e;
                            firsteinser = false;
                        }
                    }
                }
                // w2 erzeugen, nach der h0
                if( texttahtiswork.length !== 0 ){
                    if( indexWzwei === 0 ){ //letzte Position autor 1
                        indexWzwei = woerterZuWe.length;
                    }
                    indexWzwei += indexJzwei;
                    counth1+=1;
                    //console.log( "-------- WERK: ", Wek, Wel);
                    //console.log( "--------       ",woerterZuWe , "....", ws.slice( indexJzwei, indexend ), "Naechster succhindex: ", indexWzwei, ws.slice( indexWzwei, indexend ) );

                    //QUICK CHECK FOR A POSSIBLE RANGE OF numbers
                    let woerterZuNum = []; 
                    goon = true;
                    j = indexWzwei;
                    
                    while( goon ){
                        if( j < indexend ){
                            if(ws[j]){
                                let wo = ws[j].replace(".","").replace(",","");
                                if( wo !== "" && !isNaN(parseInt(wo))){ //zifferstring[] and romannum
                                    //console.log(j, wo, parseInt(wo));
                                    woerterZuNum.push(1);
                                } else {
                                    woerterZuNum.push(0);
                                }
                            }
                            j+=1;
                        } else {
                            goon = false;
                        }
                    }
                    //suche erste 1ser reihe im array
                    firsteinser = true;
                    let texttahtisnumber = [];
                    let indexNzwei = 0;
                    //console.log(woerterZuNum.toString());
                    for( let e = 0; e < woerterZuNum.length; e+=1 ){
                        if( woerterZuNum[ e ] === 1 && firsteinser ){
                            texttahtisnumber.push( ws[indexWzwei+e] );
                        } else {
                            if( texttahtisnumber.length !== 0 && firsteinser ){
                                indexNzwei = e;
                                firsteinser = false;
                            }
                        }
                    }
                    
                    
                    if( texttahtisnumber.length !== 0 ){
                        // w2 erzeugen, nach der h0
                        if( indexNzwei === 0 ){ //letzte Position autor 1
                            indexNzwei = woerterZuNum.length;
                        }
                        indexNzwei += indexWzwei;
                        //console.log( ws.slice( indexWzwei-2, indexNzwei+2 ).toString() );
                        counth2+=1;
                        
                        //do return not only as a STRINg, BUT cts and a array (?)
                        let numbering = ws.slice( indexWzwei, indexNzwei ).join(" ");
                        let tempstr = "["+Au+" "+Wek+" "+ numbering +"]";
                        if( rettext.indexOf( tempstr ) === -1 ){
                            rettext += "<b>"+tempstr+"</b><br>";
                            awnARRAY.push([Au, Wek, numbering])
                        }
                        //console.log( "-Nummer: ", ws.slice( indexWzwei, indexNzwei ), texttahtisnumber, woerterZuNum, ws.slice( indexWzwei, indexend ));
                    }
                }
            }
        }
    }
    return [counth0, counth1, counth2, rettext, indexstart, awnARRAY]; //endindex, RETURN THE DATA IN ARRAY, build dict with positions AND PASS IT TO deep FKT 
}

/*H1fast*/
function H1fast( davor, danach, h0 ){
    //console.warn("h0", h0, "davor", davor,"danach", danach);
    let toreturnAll = [];
    for( let kurz = 0; kurz < h0.length; kurz += 1 ){
        //console.log(  h0[kurz] );
        if( abkAW[h0[kurz]] ){
            let toreturn = [];
            let werke = abkAW[ h0[ kurz ] ][1];
            //console.log(werke);
            //check direct fast
            let resuuW = werke[davor]; //groß und klein schreibung das geht noch besser mit allen permutationen der wörter davor und danach!!!
            if( resuuW ){
                toreturn.push(davor); 
            } else {
                resuuW = werke[danach];
                if( resuuW ){
                    toreturn.push(danach); 
                } else {
                    let nicht = True;
                    let wosofdanach = danach.split(" ");
                    
                    for( let g = 0; g < wosofdanach.length; g+=1 ){
                        let reppp = wosofdanach[g].replace(".", "").replace(",", "");
                        if( isNaN(parseInt( reppp ))){
                            
                            for( let k in werke ){
                                //console.log(k, reppp); //Wort clean anpassungen !!! gives better perf
                                let klow = k.toLowerCase();
                                if( reppp.indexOf( klow ) !== -1 || klow.indexOf( reppp ) !== -1 ){
                                    toreturn.push( k ); 
                                    nicht = False;
                                }
                             }
                        }
                    }
                    if(nicht){
                        let A = ngram( davor, 3, False );
                        let B = ngram( danach, 3, False );
                        let lena = len( A );
                        let lenb = len( B );
                        //check dist kurzformen !!! mit containedness LCS
                        /*
                        for( let k in werke ){
                            let C = ngram( k, 3, False ); //grosz und kleinschreibung etc beachten
                            let longestsubseq1 = LCS( A, C );
                            let longestsubseq2 = LCS( B, C );
                            let lenc = len( C );
                            let l1 = longestsubseq1/lenc; //kind of contained ness like i liked to define it
                            let l2 = longestsubseq2/lenc;
                            let l3 = longestsubseq1/lena; //kind of contained ness like i liked to define it
                            let l4 = longestsubseq2/lena;
                            let l5 = longestsubseq1/lenb; //kind of contained ness like i liked to define it
                            let l6 = longestsubseq2/lenb;
                            console.log(danach, k, lenc, l1, l2, "...", lena, l3, l4, "...", lenb, l5, l6);
                            if(  0.5 < l1 ||  0.5 < l2  || 0.5 < l3 ||  0.5 < l4 || 0.5 < l5 ||  0.5 < l6 ){
                                toreturn.push( k ); 
                                nicht = False;
                            } 
                        }*/
                    
                    if(nicht){
                        //check dist
                        let mindist = 100000;
                        let kurzATmindist = "";
                        for( let k in werke ){
                            
                            let Cl = ngram( werke[ k ], 3, True );

                            //baire is faster!!! same in accurate??
                            /*let v = diceMASZ( A, Cl );
                            let vv = diceMASZ( B, Cl );
                            let Ck = ngram( k, 3, True );
                            let vvv = diceMASZ( A, Ck );
                            let vvvv = diceMASZ( B, Ck );*/
                            let v = baire( A, Cl );
                            let vv = baire( B, Cl );
                            let Ck = ngram( k, 3, True );
                            let vvv = baire( A, Ck );
                            let vvvv = baire( B, Ck );
                            //console.log(danach, werke[ k ], v, vv, mindist);
                            if( v < mindist ){
                                mindist = v;
                                kurzATmindist = k;
                            } 
                            else if( vv < mindist ){
                                mindist = vv;
                                kurzATmindist = k;
                            }
                            else if( vvv < mindist ){
                                mindist = vvv;
                                kurzATmindist = k;
                            }
                            else if( vvvv < mindist ){
                                mindist = vvvv;
                                kurzATmindist = k;
                            } 
                        }
                        //console.log(danach, werke[ k ], v, vv, mindist);
                        if( mindist < 0.9 ){
                            toreturn.push( kurzATmindist ); 
                        } 
                    }
                    }
                }
            }
            //console.log(toreturn);
            toreturnAll.push( toreturn );
        } 
    } 
     /* let basearray = AbkKeys;
    if( long ){
        basearray = langVonAbkKeys;
    }
    let minval = 1000000;
    let grund = "";
    let hypo = "";
    for( let s = 0; s < stringarray.length; s+=1 ){ 
        let A = stringarray[ s ];
        let lA = len(A);
        //W in lang[Abk] and lang[Abk] in W
        for( let a  = 0; a < basearray.length; a++ ){
            let B = basearray[ a ];
            let lB = len(B);
            let lev = levenshtein( A, B );
            let v =  lev - Math.abs(lB - lA);
            //let v = diceMASZ( stringarray[ s ], basearray[ a ] );
            let theLCS = LCS( A, B );
            let v = ( ( theLCS / lA ) + ( theLCS / lB ) ) * 0.5;
            if( minval > v ){
                minval = v;
                grund = A;
                hypo = B;
            }
        }
    }*/
    
    return toreturnAll;
}

/*H0 FAST AND ALL*/
function checkDirectH0( checkarray ){ //si sa simply check against key value list
    let resuarr = [];

    for( let c = 0; c < checkarray.length; c++ ){
        /*let e1  = inverseabkAWWAkba[ checkarray[ c ] ];
        if( e1 ){
            if( resuarr.indexOf( e1 ) == -1 ){
                resuarr.push( inverseabkAWWAkba[ checkarray[ c ] ] );//abkAW[ inverseabkAWWAkba[ checkarray[ t ] ] ];
            }
        }*/
        let cheche = checkarray[ c ].toUpperCase();
        let e2 = abkAW[ cheche ];
        if( e2 ){
            if( resuarr.indexOf( cheche ) == -1 ){ //not already in resu array
                resuarr.push( cheche );
            }
        }
        
    }

    //returns array of abk - of level 0
    if( resuarr.length == 0 ){
        return false;
    } else {
        //console.log(checkarray, "H0 DIRECT CHECK", resuarr)
        //saveNERtoHEURISTIC(NER, Array aus vorhertext text und nachher text)
        return resuarr; //return value handels like TRUE in if clause
    }
}

function getHij( astring ){
    let name = astring;
    let nameTri = ngram( name, 3, False );
    let resuold = null;
    let intersecCount = 0;
    let maxinterseccount = 0;
    let atmax = [];
    
    for(let l = 0; l < len(nameTri); l++){
        let cheche = treeGram[ nameTri[l].toLowerCase() ];
        let curresul = [];
        if( cheche ){
            curresul = cheche[0];
        }
        
        let setA = new Set( resuold );
        let setB = new Set( curresul );
        let intersec = SetIntersection(setA, setB);
        if(len( intersec ) == 0 ){
            if( maxinterseccount < intersecCount ){
                maxinterseccount = intersecCount;
                atmax = resuold;
            }
            intersecCount = 0;
            //console.log("neues beginnt");
            resuold = curresul;
        } else {
            intersecCount += 1;
            resuold = intersec;

        }
        //console.log(nameTri[l], resuold);
    }
    return atmax;
}

function H0fast( w1, w2, w3 ){ //very diffuse result
    let che = checkDirectH0( [ w1.toUpperCase()+" "+w2.toUpperCase()+" "+w3.toUpperCase() ] );
    if(che){
        return che;
    } else {
        let doustring = w1+" "+w2;
        che = checkDirectH0( [ doustring.toUpperCase() ] );
        if(che){
            return che;
        } else {
            che = checkDirectH0( [ w1.toUpperCase() ] );
            if(che){
                return che;
            } else {
                che = getHij( doustring ); //only possible names from tree gram tree
                if( che ){
                    return che;
                } else {
                    return false;
                }
            }
        }
    }
}

function zahstruk( ws ){
    let arrofindices = [];
    let old = null;
    for( let w = 0; w < ws.length; w += 1 ){
        //console.log(ws[w])
        if( !isNaN( parseInt(ws[ w ].replace(".","").replace(",","") ) ) ){
            if( old+1 !== w ){
                //console.log("ta");
                arrofindices.push(w);
            }
            old = w;
        }
        
    }
    return arrofindices;
}

function combh0fastwithh1fast( h0, h1 ){
    //console.log(h0, h1);
    let abk = len( h1 );
    let h0hicombined = [];
    
    for( let i = 0; i < abk; i+=1){
        if( 0 < h1[i].length  ){
            h0hicombined.push( [ h0[i], h1[i] ] );
        }
    }
    return h0hicombined;
}


/*------------------------------------------------------------------------------

MEIN EXT AND GEN FKT             

------------------------------------------------------------------------------*/

function GENCTSURN2( astring ){ //EXT IS GEN!
	var zeit0 = performance.now();

    //string in einzelne worte zuerlegen, ecomparatio angleich, gucken, ob einzeln in Liste, oder in Gruppen, oder in Transformationenen
    astring = astring.split("-").join( "- " ).split(".").join(". ").split(",").join(", ").split("  ").join(" ");
    astring = astring.replace( fromNEWL, " " );
    astring = astring.replace( fromBR, " " );
    astring = astring.replace( fromBR2, " " );
    astring = astring.replace( fromKl1, " <");
    astring = astring.replace( fromKl2, "> ");
    astring = astring + "  ";
	astring = astring.normalize( analysisNormalform ); 
    
    //CLEANING BEREIT STELLEN; WAS SINNVOLL IST !!!!!!!
    
    //lists of words from silben.js
    normalizearraykeys( ); //should move to other code place
    //stopthiswordsL1 = normarrayk( stopthiswordsL1 );
    //lists of words from silben.js
    //stopthiswordsL1 = normarrayk( stopthiswordsL1 );
    mergeAKlists( );
    buildTree( ); //treeGram

	let ws = delklammern( sigmaistgleich( delgrkl( delumbrbine( delligaturen( Trennstricheraus( delmakup( astring ).split( " " ) ).join( " " )))))).split( " " ); //TOKENS WHAT, NO need to CARE
    //klammern
    //Interpunktion??
    //bindestriche???
    
    //appnd to array to have 4 indices more
    let rettextasarray = [];//return text
    let w = 0;
    for( w = 0; w < ws.length; w+=1){
        ws[ w ] = ws[ w ].trim();
        if( ws[ w ].length !== 0 ){
            rettextasarray.push( ws[ w ].replace("-", "").replace(",","").replace(";","") );  
        }
    }
    rettextasarray.push("");
    rettextasarray.push("");
    rettextasarray.push("");
    rettextasarray.push("");
    ws = [];
    for( w = 0; w < rettextasarray.length; w+=1){ 
        ws.push(rettextasarray[w]);
    }
    
    console.log("Anzahl d. Wörter: ", ws.length);
    //console.log("Anzahl d. Keys-kurz: ", AbkKeys.length);
    //console.log("Anzahl d. Keys-lang: ", langVonAbkKeys.length);
    //hypothesis sets (a.k.a. array)
    let allh0 = [];
    let allh1 = [];
    let allh2 = [];


    //THE return text and added CTS URN, the Choise function maybeURN()
    let retasarray = []; //return cts 
    
    
    let zahindices = zahstruk( ws );
    //console.log(zahindices);
    let zeit4 = performance.now( );
    console.log( "ZahStru dauerte " + (zeit4 - zeit0) + " ms. Count: " );

    let abbruch =  rettextasarray.length;
    //
    let rangeeee = 10;
    for(let t in zahindices){
        
        let sta = zahindices[t]-rangeeee;
        if(t > 0){
            if( sta < zahindices[t-1] ){
                sta = zahindices[t-1]+1;
            }
        }
        if( sta < 0 ){
            sta = 0;
        }
        
        for( w = sta; w < zahindices[t]; w+=1 ){
        
        if( 2 < ws[ w ].length &&
            isNaN( parseInt( ws[ w ].replace(".","").replace(",","") ) )  ){
                
                let che = H0fast( ws[ w ], ws[ w+1 ], ws[ w+2 ] );
                if( che ){
                    let hijl = len( che );
                    if( hijl > 0 && hijl < 100 ){
                        allh0.push( [w, che] );
                    } else {
                        allh0.push( false );
                    }
                } else {
                    allh0.push( false );
                }
            /*
            */
        } else {
            allh0.push(false);
        }
        }
	}
    let zeit2 = performance.now();
    
    let abr = len( allh0 );
    console.log( "H0fast dauerte " + (zeit2 - zeit4) + " ms. Count: ", abr );
    for( let a = 0; a < abr; a+=1 ){
        if( allh0[ a ] ){
            let w = allh0[ a ][ 0 ];
            let stringdavor = ""; //HIER MUESSEN UNTER UMSTAENDEN NOCH DIE LEEREN WOERTER RAUS GEMACHT WERDEN; ODER GANZ VORHER
            let d = w-1;
            while( d > 0 && w-d < 4 ){
                stringdavor += ws[ d ];
                d-=1;
            }
            let stringdanach = "";
            d = w+1;
            while( d < ws.length && d-w < 4 ){
                stringdavor += ws[ d ];
                d+=1;
            }
            let resu = H1fast( stringdavor, stringdanach, allh0[a][1] );
            //console.log( stringdavor, allh0[a][1], resu, stringdanach );
            allh1.push( resu );
            
        } else {
            allh1.push( [] );
        }
    }
    
    //console.log(allh0, allh1)
    var zeit1 = performance.now();
    console.log("H1fast dauerte " + (zeit1 - zeit2) + " ms.");
    let countcheckpunkte = 0;
    let allcombined = [];
    for( let a = 0; a < abr; a+=1 ){
        if( allh0[ a ] ){
            //console.log( allh0[a][0], " WORT: ", ws[allh0[a][0]],"H0:",allh0[a][1], " H1: ", allh1[a]);
            let h0h1com = combh0fastwithh1fast( allh0[a][1], allh1[a] );
            if( h0h1com.length !== 0 ){
                countcheckpunkte += 1;
                allcombined.push( [ allh0[a][0], h0h1com ] );
                //console.log( allh0[a][0], " WORT: ", ws[allh0[a][0]],"H0H1: ", allcombined[allcombined.length-1]);
            }
        }
    }
    console.log("Checkpunkt Anzahl " , countcheckpunkte);
    //console.log(allcombined);
    abr = len( allcombined );
    let ch0 = 0;
    let ch1 = 0;
    let ch2 = 0;
    let olergcount = ["","","",""];
    for( let l = 0; l < abr; l++ ){
        //reject all hypothesis and take a close look
        let s = allcombined[l][0];
        let e = s+10;
        if( abbruch < e ){
            e = abbruch;
        }
        //hypothesen kontrolle
        let ergcounts = H0H1H2ranges( ws, allcombined[l] );
        ch0 += ergcounts[0];
        ch1 += ergcounts[1];
        ch2 += ergcounts[2];
        
        if( ergcounts[3] !== "" &&
            olergcount[3] !== ergcounts[3] ){
            //console.log(ergcounts[4], ergcounts[5]);
            retasarray.push( [ergcounts[4], ergcounts[5]] );
            
            //build cts and hav a nice anchor to the base text and hava a list compiled
            rettextasarray[ ergcounts[4] ] = " " + ergcounts[3] + " "+ rettextasarray[ ergcounts[4] ] ;
        }
        olergcount = ergcounts;
        //safe the fast hypothesisi per point in TEXT in dict array
    }
    let zeit3 = performance.now();
    console.log("H0H1H2 dauerte " + (zeit3 - zeit1) + " ms.");
    console.log("Anzahl h0 Punkte: ", ch0, "Anzahl h1 Punkte: ",ch1,"Anzahl h2 Punkte: ",ch2);
    //checkpunkte erneut ausgeben, in drei Ebenen - h0 unsicher, h0h1 sicherer, h0h1h2 sicher
    //bereiche erneut untersuchen und sich gegenseitig ausschließen lassen !!! oder irgendwie
    
    /*                      check deep                                        */
    var zeit5 = performance.now();
    let resuDEEP = H0H1H2deep( ws, retasarray );
    console.log("Deep dauerte " + (zeit5 - zeit3) + " ms.");
    
    console.log("Dauerte gesamt " + (zeit5 - zeit0) + " ms.");
	//return [ retasarray, rettextasarray.join( " " ) ];
    return resuDEEP;
}

/*------------------------------------------------------------------------------
                            AUSGABE VARIANTEN 
------------------------------------------------------------------------------*/

function hyptotext( h2, h1, h0, retasarray, w ){ //no return value but retarray is given as reference - ?
    if( h2.length > 0 ){
        console.log("full", h0, h1, h2);
        
        //wenn ein Autor gegeben ist
        if( h0[1].length > 1 ) { //if morge level 0
            console.log("MEHRER H0 Hypos!!!" ); //hier müssenw ir dann eine genaue zurodung haben!!!!
        } else { //if one level 0 ref
            retasarray.push("<br>");
            let hand = "🖛";
            let colortoit = "//"+((1<<24)*Math.random()|0).toString(16);
            for(let i = 0; i < h1.length; i++){
                
                if(i%2 == 0){
                    hand = "🖛";
                } else {
                    hand = "🖙";
                }
                for(let h = 0; h < h2.length; h++){
                    retasarray.push( "<span class='l2' forcsv=\'"+h0[1]+";;"+h1[i]+";;"+h2[h]+"\'> <span style='color:"+colortoit+";' name='startpoint' class='l2' id='"+w.toString()+"'> "+hand+"</span> <a href='hcts.html?GetPassage&URN:CTS:*:"+h0[1]+":"+h1[ i ]+":"+h2[h]+"' target='_blank' style='color:"+colortoit+";'  class='refeintrag'>"+h0[1]+" "+h1[i]+" "+h2[h]+"</a><br></span>");
                }
            }
            //what if more level 2 - ZUORNUNDGSPROBLEM - ist das möglich????
         }
    } else if( notempty1(h1) ){
        console.log("halb", h0, h1);
        
        if( h0[1].length > 1 ){ //if morge level 0
            console.log("MEHRER H0 Hypos!!!" ); //hier müssenw ir dann eine genaue zurodung haben!!!!
        } else {
            retasarray.push("<br>");
            let colortoit = "//"+((1<<24)*Math.random()|0).toString(16);
            for(let i = 0; i < h1.length; i++){
                
                retasarray.push( "<span class='l1' style='display:none;' forcsv=\'"+h0[1]+";; "+h1[i]+";; \'> <span style='color:"+colortoit+";' name='startpoint' id='"+w.toString()+"'>&emsp;&emsp; ✋</span> <a href='hcts.html?GetPassage&URN:CTS:*:"+h0[1]+":"+h1[ i ]+"' target='_blank' style='color:"+colortoit+";' class='refeintrag'>"+h0[1]+" "+h1[i]+"</a><br></span>");
            }
        }
    } else if( h0[0] > 0 ){
        console.log("low", h0);
       
        if( h0[0] >= 0.7 && h0[1].length < 5 ){ //verfahren und eindeutigkeit
             retasarray.push("<br>");
            let colortoit = "//"+((1<<24)*Math.random()|0).toString(16);
            for(let i = 0; i < h0[1].length; i++){
                retasarray.push( "<span class='l0' style='display:none;' forcsv=\'"+h0[1]+";; ;; \'> <span style='color:"+colortoit+";' name='startpoint' id='"+w.toString()+"'>&emsp;&emsp;&emsp; 🖓</span> <a href='hcts.html?GetPassage&URN:CTS:*:"+h0[1][i]+"' target='_blank' style='color:"+colortoit+";'  class='refeintrag'>"+h0[1][i]+"</a> ("+h0[2].toString()+")<br></span>");
            }
        }
    } 
}
